[["Blessed is the man / Who does not walk / In the counsel of the wicked, / Nor stand on the path of sinners, / Nor sit in the seat of mockers;","Rather his delight is in the law of Jehovah, / And in His law he meditates by day and by night.","And he will be like a tree / Transplanted beside streams of water, / Which yields its fruit in its season, / And whose foliage does not wither; / And everything he does prospers.","The wicked are not so, / But are like chaff, / Which the wind drives away.","Therefore the wicked will not stand in the judgment; / Nor the sinners, in the assembly of the righteous.","For Jehovah knows the way of the righteous, / But the way of the wicked will perish."],["Why are the nations in an uproar, / And why do the peoples contemplate a vain thing?","The kings of the earth take their stand, / And the rulers sit in counsel together, / Against Jehovah and against His Anointed:","Let us break apart Their bonds / And cast Their ropes away from us.","He who sits in the heavens laughs; / The Lord has them in derision.","Then He will speak to them in His anger, / And in His burning wrath He will terrify them:","But I have installed My King / Upon Zion, My holy mountain.","I will recount the decree of Jehovah; / He said to Me: You are My Son; / Today I have begotten You.","Ask of Me, / And I will give the nations as Your inheritance / And the limits of the earth as Your possession.","You will break them with an iron rod; / You will shatter them like a potter’s vessel.","Now therefore, O kings, be prudent; / Take the admonition, O judges of the earth.","Serve Jehovah with fear, / And rejoice with trembling.","Kiss the Son / Lest He be angry and you perish from the way; / For His anger may suddenly be kindled. / Blessed are all those who take refuge in Him."],["Jehovah, how many are my adversaries! / Many are those who rise up against me!","Many are those who say of my soul, / There is no salvation for him in God! Selah","But You, O Jehovah, are a shield around me, / My glory and the One who lifts up my head.","With my voice I call out to Jehovah, / And He answers me from His holy mountain. Selah","I lay down and slept; / I awoke, for Jehovah sustains me.","I will not fear the myriads of the people / Who have set themselves against me all around.","Arise, O Jehovah; / Save me, O my God! / Oh that You would strike all my enemies on the cheek; / And break the teeth of the wicked.","Salvation is of Jehovah: / Your blessing be upon Your people. Selah"],["When I call out, answer me, / O God of my righteousness; / Make room for me when I am in straits; / Be gracious to me and hear my prayer.","O sons of men, how long will my glory be made a reproach? / How long will you love vanity, will you seek a lie? Selah","But know that Jehovah sets apart the faithful man for Himself. / Jehovah hears when I call out to Him.","Be angry, yet do not sin; / Consider in your heart upon your bed, / And be silent. Selah","Offer sacrifices of righteousness, / And trust in Jehovah.","Many are those who say, Who will show us any good? / Lift up upon us the light of Your countenance, O Jehovah.","You have put joy in my heart, / More than when the grain and new wine of others abound.","In peace I will both lie down and sleep, / For You alone, O Jehovah, cause me to dwell in safety."],["To my words give ear, O Jehovah; / Consider my moaning.","Give heed to the sound of my cry, / My King and my God; / For to You do I pray.","O Jehovah, in the morning / You will hear my voice; / In the morning I will set forth my words in order to You, / And I will watch.","For You are not a God who delights in wickedness; / Evil will not sojourn with You.","Those who boast will not stand / Before Your eyes; / You hate all workers of iniquity.","You will destroy those who speak lies. / Jehovah abhors a man of bloodshed and deceit.","But as for me, in the abundance of Your lovingkindness / I will come into Your house; / I will bow down toward Your holy temple / In fear of You.","O Jehovah, lead me in Your righteousness / On account of those who lie in wait for me; / Make Your way straight before me.","For there is no truth in their mouth; / Their inward part is corruption itself; / Their throat is an open grave; / They flatter with their tongue.","Hold them guilty, O God; / Let them fall by their own counsels; / Because of the multitude of their transgressions thrust them out, / For they have rebelled against You.","But let all who take refuge in You rejoice; / Let them shout for joy forever; / And may You spread a cover over them; / And those who love Your name / Will exult in You.","For You will bless the righteous man, O Jehovah; / You will surround him with favor as with a shield."],["O Jehovah, do not rebuke me in Your anger, / Nor chasten me in Your burning wrath.","Be gracious to me, O Jehovah, for I am languishing; / Heal me, O Jehovah, for my bones are shaken,","And my soul is greatly shaken. / But as for You, O Jehovah, how long?","Return, O Jehovah; deliver my soul; / Save me for Your lovingkindness’ sake.","For in death there is no remembrance of You; / In Sheol who can give thanks to You?","I am weary with my groaning; / Every night I cause my bed to swim; / With my tears I dissolve my couch.","My eye is wasted because of grief; / It has aged because of all those who vex me.","Depart from me, all you workers of iniquity, / For Jehovah has heard the sound of my weeping.","Jehovah has heard my supplication; / Jehovah receives my prayer.","All my enemies will be ashamed and greatly dismayed; / They will turn back; they will be put to shame suddenly."],["O Jehovah my God, in You do I take refuge. / Save me from all who pursue me, and deliver me;","Lest he tear my soul like a lion, / Tearing it apart without anyone to deliver it.","O Jehovah my God, if I have done this, / If there is unrighteousness in my hands,","If I have recompensed with evil him who was at peace with me / (Rather, I have delivered him who vexed me without cause);","Let the enemy pursue my soul and overtake me, / And let him trample my life to the ground / And lay my glory down in the dust. Selah","Arise, O Jehovah, in Your anger; / Lift Yourself up against the overflowing wrath of those who vex me, / And awake for me: You have commanded judgment.","And let the assembly of the peoples surround You, / And over it return on high.","Jehovah will execute judgment on the peoples; / Judge me, O Jehovah, according to my righteousness / And according to my integrity that is with me.","Oh, let the evil of the wicked come to an end, / But establish the righteous man. / For the righteous God / Tries the hearts and the inward parts.","My shield is with God, / Who saves the upright in heart.","God is a righteous Judge / And a God who has indignation every day.","If one does not turn, He will whet His sword. / He bends His bow and makes it ready.","And He prepares instruments of death against him; / He has made His arrows fiery shafts.","Behold, the evil man travails with iniquity; / He conceives mischief and brings forth falsehood.","He digs a pit and hollows it out, / Then he falls into the hole that he has made.","His mischief returns upon his own head, / And upon the crown of his own head his violence comes down.","I will give thanks to Jehovah according to His righteousness, / And I will sing psalms to the name of Jehovah the Most High."],["O Jehovah our Lord, / How excellent is Your name / In all the earth, / You who have set Your glory over the heavens!","Out of the mouths of babes and sucklings / You have established strength / Because of Your adversaries, / To stop the enemy and the avenger.","When I see Your heavens, the works of Your fingers, / The moon and the stars, which You have ordained,","What is mortal man, that You remember him, / And the son of man, that You visit him?","You have made Him a little lower than angels / And have crowned Him with glory and honor.","For You have caused Him to rule over the works of Your hands; / You have put all things under His feet:","All sheep and oxen, / As well as the beasts of the field,","The birds of heaven and the fish of the sea, / Whatever passes through the paths of the seas.","O Jehovah our Lord, / How excellent is Your name / In all the earth!"],["I will give thanks to You, O Jehovah, with all my heart; / I will tell out all Your wonders.","I will rejoice and exult in You; / I will sing psalms to Your name, O Most High.","When my enemies turn back, / They stumble and perish at Your presence.","For You have upheld my right and my cause; / You sit on the throne, judging righteously.","You have rebuked the nations; You have destroyed the wicked; / You have blotted out their name forever and ever.","The enemies are finished; they are in perpetual ruins; / And You have uprooted their cities; the very memory of them has perished.","But Jehovah sits enthroned forever; / He has established His throne for judgment.","And it is He who judges the world with righteousness; / He executes judgment on the peoples with equity.","And Jehovah is a high retreat for the oppressed, / A high retreat in times of distress.","And those who know Your name put their trust in You, / For You have not forsaken those who seek You, O Jehovah.","Sing psalms to Jehovah, the Inhabitant of Zion; / Declare His deeds among the peoples,","For He who avenges bloodshed remembers those who were slain; / He does not forget the cry of the afflicted.","Be gracious to me, O Jehovah; look on my affliction from those who hate me, / You who raise me from the gates of death,","That I may tell out all Your praises / And, in the gates of the daughter of Zion, exult in Your salvation.","The nations have sunk in the pit that they have made; / In the net that they hid, their own foot is caught.","Jehovah has made Himself known; He has executed justice; / The wicked have been snared in the work of their hands. Higgaion. Selah","The wicked will be turned back to Sheol, / All the nations who forget God.","For not always will the needy be forgotten, / Nor will the hope of the afflicted perish forever.","Arise, O Jehovah! Let not mortal man prevail; / Let the nations be judged in Your sight.","Put them in fear, O Jehovah; / Let the nations know that they are mortal men. Selah"],["Why, O Jehovah, do You stand far off? / Why do You hide Yourself in times of distress?","Arrogantly the wicked hotly pursue the poor — / May they be caught in the plots that they devise!","For the wicked man boasts of the desire of his soul, / And the rapacious man curses, even despises, Jehovah.","The wicked man, according to the haughtiness of his countenance, / Says, He will not require it; / All his thoughts are this: There is no God!","His ways succeed at all times; / Your judgments are on high, out of his sight; / As for all his adversaries, he snorts at them.","He has said in his heart, I will not be shaken; / I will be in no trouble forever.","His mouth is full of curses and of deceit and oppression; / Under his tongue are mischief and iniquity.","He sits in the ambushes of the open villages; / In hidden places he murders the innocent; / His eyes secretly watch for the unfortunate.","He lurks in secret like a lion in its covert; / He lurks ready to seize the poor; / He seizes the poor, drawing them up in his net.","He stoops, he crouches, / And the unfortunate fall by his mighty claws.","He has said in his heart, God has forgotten; / He has hidden His face; He will never see this.","Arise, O Jehovah; O God, lift up Your hand. / Do not forget the poor.","Why does the wicked man despise God / And say in his heart, You will not require it?","You do see! For You observe mischief and vexation, / To requite it with Your own hand. / To You the unfortunate one commits his cause; / You have been the help of the orphan.","Break the arm of the wicked man and the evildoer; / Seek out his wickedness until You find no more.","Jehovah is King forever and ever; / The nations have perished from His land.","You have heard the desire of the lowly, O Jehovah; / You will establish their heart; You will cause Your ears to listen,","In order to execute justice for the orphan and the oppressed one, / That the mortal man of the earth may terrorize no longer."],["In Jehovah have I taken refuge. How can you say to my soul, / Flee to the mountains like a bird?","For behold, the wicked bend the bow; / They ready their arrow on the string / To shoot in the dark at the upright in heart.","When the foundations are destroyed, / What will the righteous man do?","Jehovah is in His holy temple; / Jehovah — His throne is in heaven. / His eyes behold; / His eyelids try the sons of men.","Jehovah tries the righteous man; / But the wicked man and him who loves violence, His soul hates.","He will rain down snares upon the wicked; / Fire and brimstone and a scorching wind will be the portion of their cup.","For Jehovah is righteous; He loves righteous deeds. / The upright man will behold His face."],["Save, O Jehovah; for the faithful man is no more, / For the trustworthy have vanished from among the sons of men.","Each man speaks falsehood with his neighbor; / With flattering lips and a double heart they speak.","May Jehovah cut off all the flattering lips, / The tongue speaking great things,","Those who said, With our tongue we will prevail; / Our lips are our own: Who is our lord?","Because of the devastation of the poor, because of the sighing of the needy, / I will now arise, says Jehovah; / I will set him in the safety that he longs for.","The words of Jehovah are pure words, / Silver refined in a furnace on the earth, / Purified seven times.","You, O Jehovah, will keep them; / You will guard them from this generation forever.","The wicked go about all around, / While vileness is exalted among the sons of men."],["How long, O Jehovah? Will You forget me continually? / How long will You hide Your face from me?","How long will I take counsel in my soul / And sorrow in my heart day after day? / How long will my enemy be exalted over me?","Consider and answer me, O Jehovah my God; / Enlighten my eyes lest I sleep the sleep of death,","Lest my enemy say, I have prevailed against him, / And my adversaries exult when I am shaken.","But I trust in Your lovingkindness; / My heart will exult in Your salvation;","I will sing to Jehovah, / For He has dealt bountifully with me."],["The fool has said in his heart, / There is no God. / They are corrupt; they commit abominable deeds; / There is none who does good.","Jehovah looked down from heaven / Upon the sons of men / To see if there was anyone who had insight, / Who seeks after God.","They have all turned aside; / They are together perverse. / There is none who does good; / There is not even one.","Have they no knowledge, all the workers of iniquity, / Who eat up my people as they would eat up bread / And do not call upon Jehovah?","There they were in great fear, / For God is among the generation of the righteous.","You put the counsel of the afflicted to shame, / But Jehovah is their refuge.","Oh that the salvation of Israel might come forth from Zion! / When Jehovah turns the captivity of His people, / Jacob will exult, Israel will rejoice."],["O Jehovah, who may sojourn in Your tent? / Who may dwell on Your holy mountain?","He who walks in integrity / And does righteousness / And speaks truth from his heart.","He does not slander with his tongue; / He does not do evil to his friend, / Nor does he take up a reproach against his neighbor.","In his eyes a reprobate is despised, / But he honors those who fear Jehovah. / Should he swear to his harm, / He does not change.","He does not lend his money on interest, / Nor accept a bribe against the innocent. / He who does these things will not be shaken forever."],["Preserve me, O God, for I take refuge in You.","I say to Jehovah, You are my Lord; / No good have I beyond You;","As for the saints who are on the earth, they are the excellent; / All my delight is in them.","The sorrows of them who bartered for some other god will be multiplied; / Their drink offerings of blood I will not offer, / Nor will I take up their names upon my lips.","Jehovah is the portion of my inheritance and of my cup; / You maintain my lot.","The measuring lines have fallen on pleasant places for me; / Indeed the inheritance is beautiful to me.","I will bless Jehovah, who counsels me; / Indeed in the nights my inward parts instruct me.","I have set Jehovah before me continually; / Because He is at my right hand, I shall not be shaken.","Therefore my heart rejoices and my glory exults; / Even my flesh dwells securely.","For You will not abandon my soul to Sheol, / Nor let Your Holy One see the pit.","You will make known to me the path of life; / In Your presence is fullness of joy; / At Your right hand there are pleasures forever."],["Hear, O Jehovah, what is righteous; / Give heed to my cry; / Give ear to my prayer, / Which is not made with lips of deceit.","May a judgment for me come forth from Your presence; / May Your eyes regard equity.","You have examined my heart; You have visited me by night; / You have tried me: You have found nothing. / I have resolved that my mouth will not transgress.","Regarding the works of man, by the word of Your lips, / I have kept myself from the paths of the violent man.","My steps have held fast to Your tracks; / My footsteps have not slipped.","I call on You, for You will answer me, O God; / Incline Your ear to me; hear my speaking.","Wondrously display Your lovingkindness, / You who save by Your right hand / Those who take refuge in You from them who rise up against them.","Guard me like the pupil of Your eye; / In the shadow of Your wings hide me","From the presence of the wicked who oppress me, / From my deadly enemies, who close in upon me.","They have shut up their fat hearts; / With their mouths they speak arrogantly.","Now they have surrounded us in our steps; / They have fixed their eyes on casting us down to the ground.","He is like a lion that is eager to tear, / And like a young lion lurking in hidden places.","Arise, O Jehovah, confront him; bring him down. / With Your sword rescue my soul from the wicked man,","From mortal men with Your hand, O Jehovah, / From mortal men of the world, whose portion is in this life, / And whose belly You fill with Your treasure; / They are satisfied with children, / And they leave their abundance for their little ones.","As for me, in righteousness I will behold Your face; / When I awake, I will be satisfied with Your likeness."],["I love You, O Jehovah, my strength.","Jehovah is my crag and my fortress and my Deliverer; / My God, my rock, in whom I take refuge; / My shield and the horn of my salvation, my high retreat.","I called upon Jehovah, who is worthy of praise, / And from my enemies I was saved.","The cords of death encompassed me; / And the torrents of destruction assailed me.","The cords of Sheol surrounded me; / The snares of death confronted me.","In my distress I called upon Jehovah / And cried out to my God. / He heard my voice from His temple, / And my cry before Him came to His ears.","Then the earth shook and quaked, / And the foundations of the mountains trembled and shook about, / For He was furious.","Smoke went up from His nostrils, / And fire from His mouth devoured; / Coals blazed forth from Him.","He bowed the heavens down and descended, / And deep darkness was under His feet.","He rode upon a cherub and did fly; / He darted upon the wings of the wind.","He made darkness His hiding place, His pavilion around Him: / Dark waterclouds, thick clouds of the skies.","Out of the brightness before Him there broke through His clouds / Hail and fiery coals.","Then Jehovah thundered in heaven, / And the Most High uttered His voice.","And He sent forth His arrows and scattered my enemies; / And He shot forth lightning bolts and discomfited them.","The channels of the sea were seen, / And the foundations of the habitable land were laid bare / At Your rebuke, O Jehovah, / At the blast of the breath of Your nostrils.","He reached forth from on high; He took me; / He drew me out of great waters.","He delivered me from my strong enemy / And from those who hate me, for they were too mighty for me.","They confronted me in the day of my calamity, / But Jehovah became my support.","He brought me forth to a place broad and free; / He rescued me, for He took delight in me.","Jehovah has recompensed me according to my righteousness; / According to the cleanness of my hands He has repaid me.","For I have kept the ways of Jehovah / And have not acted wickedly by turning away from my God.","For all His judgments were before me, / And I did not turn His statutes away from me.","I was perfect toward Him, / And I kept myself from my iniquity.","Therefore Jehovah recompensed me according to my righteousness, / According to the cleanness of my hands in His sight.","With the faithful You show Yourself faithful, / With a perfect man You show Yourself perfect,","With the pure You show Yourself pure, / And with the perverse You show Yourself contrary.","For it is You who save the afflicted people, / But the haughty eyes You bring down;","For it is You who light my lamp; / Jehovah my God lights up my darkness;","For by You I can run up against a troop; / Indeed by my God I can leap over a wall.","As for God, His way is perfect; / The word of Jehovah is tried. / He is a shield to all who take refuge in Him.","For who is God other than Jehovah, / And who is a rock but our God?","The God who girds me with strength / And makes my way perfect,","Who makes my feet like hinds’ feet / And sets me on my high places,","Who teaches my hands to wage war / So that my arms may bend a bronze bow.","And You have given me the shield of Your salvation, / And Your right hand supports me; / And Your condescending gentleness has made me great.","You have broadened the places of my steps under me, / And my feet have not slipped.","I pursued my enemies and overtook them, / And I did not turn back until they were consumed.","I shattered them, so that they were not able to rise up; / They fell under my feet.","And You girded me with strength for war; / You brought down under me those who rose up against me.","You also made my enemies turn their back to me, / And I annihilated those who hated me.","They cried out, but there was no one to save them; / They cried out to Jehovah, but He did not answer them.","Then I beat them like dust before the wind; / Like the mud of the streets I pounded them.","You rescued me from the strivings of the people; / You have made me the head of the nations; / A people whom I had not known serves me.","At the mere hearing of a report, they obey me; / Foreigners come cringing to me;","Foreigners are discouraged / And come quaking out of their fortresses.","Jehovah lives; and blessed be my rock, / And exalted be the God of my salvation,","The God who executes vengeance for me / And subdues peoples under me,","Who rescues me from my enemies. / Indeed You exalted me above those who rise up against me; / From the violent man You delivered me.","Therefore I give thanks to You among the nations, O Jehovah; / And I will sing psalms to Your name.","It is He who magnifies salvation to His king / And executes lovingkindness to His anointed, / To David and to his seed forever."],["The heavens declare the glory of God, / And the expanse proclaims the work of His hands.","Day to day pours forth speech, / And night to night tells out knowledge.","There is no speech and there are no words; / Their voice is not heard.","In all the earth their line has gone forth, / And their words to the end of the world. / In the heavens He has made a tent for the sun,","And he, like a bridegroom, goes forth from his canopy; / He rejoices like a mighty man running the course.","His going forth is from the end of the heavens, / And his circuit is unto their ends; / And there is nothing hidden from his heat.","The law of Jehovah is perfect, / Restoring the soul; / The testimony of Jehovah is faithful, / Making the simple wise;","The precepts of Jehovah are right, / Making the heart joyous; / The commandment of Jehovah is clear, / Enlightening the eyes;","The fear of Jehovah is pure, / Enduring forever; / The judgments of Jehovah are truth / And altogether righteous.","More to be desired are they than gold, / Even much refined gold; / Sweeter also than honey / And the drippings of the honeycomb.","Moreover by them Your servant is warned; / In keeping them there is much reward.","Who can discern his errors? / Clear me of my secret faults.","Also keep back Your servant from presumptuous sins; / Do not let them have dominion over me; / Then I will be blameless and cleared / Of great transgression.","May the words of my mouth and the meditation of my heart / Be acceptable before You, / O Jehovah, my rock and my Redeemer."],["May Jehovah answer you in the day of trouble; / May the name of the God of Jacob set you on high.","May He send you help from the sanctuary / And support you from Zion.","May He remember all your meal offerings / And accept your burnt offering. Selah","May He give you according to your heart’s desire / And fulfill all your intention.","May we shout victoriously in Your salvation / And raise the banner in the name of our God. / May Jehovah fulfill all your petitions.","Now I know / That Jehovah saves His anointed; / He will answer him from His holy heaven / With mighty acts of salvation from His right hand.","Some boast in chariots, and some in horses; / But we boast in the name of Jehovah our God.","They are humbled and fallen, / But we have risen and stand upright.","Save, O Jehovah! / May the king answer us when we call."],["O Jehovah, in Your strength the king rejoices, / And in Your salvation how greatly does he exult.","You have given him his heart’s desire / And have not withheld the request of his lips. Selah","For You meet him with blessings of goodness; / You have set a crown of refined gold on his head.","He asked life of You; You granted it to him: / Length of days forever and ever.","His glory is great in Your salvation; / You have laid majesty and splendor upon him;","For You have made him to be blessings forever; / You have made him glad with rejoicing in Your presence.","For the king trusts in Jehovah; / And because of the lovingkindness of the Most High, he is not shaken.","Your hand finds all Your enemies; / Your right hand finds those who hate You.","You make them like a furnace of fire / When Your presence appears. / Jehovah swallows them in His anger, / And fire devours them.","You destroy their fruit from the earth, / And their seed from among the sons of men.","Although they intend evil against You, / And they think up a scheme, they will not prevail.","For You make them turn their back; / You aim with Your bowstrings at their faces.","Be exalted, O Jehovah, in Your strength; / We will sing and psalm Your might."],["My God, my God, why have You forsaken me? / Why are You so far from saving me, / From the words of my groaning?","O my God, I call out in the day, but You do not answer; / And in the night, but there is no rest for me.","But You are holy, You who sit enthroned / Upon the praises of Israel.","In You our fathers trusted; / They trusted and You rescued them.","To You they cried out and were delivered; / In You they trusted and were not put to shame.","But I am a worm and not a man, / A reproach of men and one despised by the people.","All who see me deride me; / They sneer at me; they shake their heads, saying,","He committed himself to Jehovah; let Him rescue him; / Let Him deliver him since He takes pleasure in him.","But You are the One who drew me forth from the womb, / Who made me trust while at my mother’s breasts.","I was cast upon You from birth; / From my mother’s womb You have been my God.","Do not be far from me, / For trouble is near, / For there is none to help me.","Many bulls surround me; / The mighty bulls of Bashan encompass me.","They open their mouth at me, / Like a ravening and roaring lion.","I am poured out like water, / And all my bones are out of joint. / My heart is like wax; / It is melted within me.","My strength is dried up like a shard, / And my tongue is stuck to my jaws; / You have put me in the dust of death.","For dogs surround me; / A company of evildoers encloses me; / They pierce my hands and feet.","I count all my bones; / They look, they stare at me.","They divide my garments to themselves, / And for my clothing they cast lots.","But You, O Jehovah, be not far off; / O my help, hasten to aid me.","Deliver my soul from the sword, / My precious life from the power of the dog;","Save me from the mouth of the lion; / Indeed while I am in the horns of wild oxen, answer me.","I will declare Your name to my brothers; / In the midst of the assembly I will praise You.","You who fear Jehovah, praise Him! / All you seed of Jacob, glorify Him! / And stand in awe of Him, all you seed of Israel!","For He has not despised nor detested / The affliction of him who is afflicted; / And He has not hidden His face from him; / But when he cried out to Him, He heard.","From You comes my praise in the great assembly; / My vows will I pay before those who fear Him.","The lowly will eat and be satisfied; / Those who seek after Jehovah will praise Him — / May your hearts live forever!","All the ends of the earth / Will remember and return to Jehovah, / And all families of the nations / Will worship before You;","For the kingdom is Jehovah’s, / And He rules among the nations.","All the flourishing of the earth / Will eat and worship. / All who go down into the dust will bow down before Him, / Even he who does not keep his soul alive.","A seed will serve Him; / That which concerns the Lord will be told to a coming generation.","They will come and declare His righteousness / To a people yet to be born, that He has done this."],["Jehovah is my Shepherd; I will lack nothing.","He makes me lie down in green pastures; / He leads me beside waters of rest.","He restores my soul; / He guides me on the paths of righteousness / For His name’s sake.","Even though I walk / Through the valley of the shadow of death, / I do not fear evil, / For You are with me; / Your rod and Your staff, / They comfort me.","You spread a table before me / In the presence of my adversaries; / You anoint my head with oil; / My cup runs over.","Surely goodness and lovingkindness will follow me / All the days of my life, / And I will dwell in the house of Jehovah / For the length of my days."],["The earth is Jehovah’s, and its fullness, / The habitable land and those who dwell in it.","For it is He who founded it upon the seas / And established it upon the streams.","Who may ascend the mountain of Jehovah, / And who may stand in His holy place?","He who has clean hands and a pure heart, / Who has not lifted up his soul to falsehood / Or sworn deceitfully.","He will receive blessing from Jehovah, / And righteousness from the God of his salvation.","This is the generation of those who seek Him, / Those who seek Your face, even Jacob. Selah","Lift up your heads, O gates; / And be lifted up, O long enduring doors; / And the King of glory will come in.","Who is the King of glory? / Jehovah strong and mighty! / Jehovah mighty in battle!","Lift up your heads, O gates; / And lift up, O long enduring doors; / And the King of glory will come in.","Who is this King of glory? / Jehovah of hosts — / He is the King of glory! Selah"],["To You, O Jehovah, / I lift up my soul.","O my God, I trust in You; / Do not let me be ashamed; / Do not let my enemies exult over me.","Indeed may all who wait on You not be ashamed; / May those who deal treacherously without cause be ashamed.","Make Your ways known to me, O Jehovah; / Teach me Your paths.","Guide me in Your truth, and teach me; / For You are the God of my salvation; / I wait on You all the day long.","Remember Your compassions, O Jehovah, / And Your acts of kindness, for they are from of old.","The sins of my youth and my transgressions, do not remember; / According to Your lovingkindness, remember me, / For the sake of Your goodness, O Jehovah.","Jehovah is good and upright; / Therefore He instructs sinners concerning the way.","He guides the lowly in justice / And teaches the lowly His way.","All the paths of Jehovah are lovingkindness and truth / To those who observe His covenant and His testimonies.","For the sake of Your name, O Jehovah, / Pardon my iniquity, for it is great.","Who then is the man who fears Jehovah? / Him will He instruct concerning the way that he should choose.","His soul will dwell in prosperity, / And his seed will possess the land.","The intimate counsel of Jehovah is to those who fear Him, / And His covenant will He make known to them.","My eyes are continually turned to Jehovah, / For He will bring my feet out of the net.","Turn toward me, and be gracious to me, / For I am alone and afflicted.","Relieve the troubles of my heart, / And bring me out of my distresses.","Look on my affliction and my suffering, / And forgive all my sins.","Look on my enemies, for they are many; / Indeed they hate me with a violent hatred.","Keep my soul, and deliver me; / Do not let me be put to shame, / For I take refuge in You.","May integrity and uprightness preserve me, / For I wait on You.","Redeem Israel, O God, / Out of all his troubles."],["Judge me, O Jehovah; / For I have walked in my integrity, / And in Jehovah I have trusted; / I will not waver.","Examine me, O Jehovah, and try me; / Test my inward parts and my heart.","For Your lovingkindness is before my eyes, / And I have walked in Your truth.","I do not sit with men of falsehood, / Nor will I associate with hypocrites.","I hate the assembly of evildoers, / Nor will I sit with the wicked.","I wash my hands in innocence / And go around Your altar, O Jehovah,","Making myself heard with the voice of thanksgiving / And telling out all Your wonderful deeds.","O Jehovah, I love the habitation of Your house, / And the place where Your glory abides.","Do not gather my soul with sinners, / Nor my life with men of bloodshed,","In whose hand is a wicked scheme, / And whose right hand is full of bribes.","But as for me, I walk in my integrity; / Redeem me and be gracious to me.","My foot stands on level ground; / In the assemblies I will bless Jehovah."],["Jehovah is my light and my salvation; / Whom shall I fear? / Jehovah is the strength of my life; / Whom shall I dread?","When evildoers come near me / To devour my flesh, / It is they, my adversaries and my enemies, / Who stumble and fall.","If an army camps against me, / My heart does not fear; / If a battle arises against me, / In spite of this I am confident.","One thing I have asked from Jehovah; / That do I seek: / To dwell in the house of Jehovah / All the days of my life, / To behold the beauty of Jehovah, / And to inquire in His temple.","For He will conceal me in His shelter / In the day of trouble; / He will hide me in the hiding place of His tent; / He will raise me up upon a rock.","And now my head is lifted up / Above my enemies who surround me. / And I will offer in His tent / Sacrifices of shouts of joy: / I will sing and psalm to Jehovah.","Hear, O Jehovah, when I call with my voice, / And be gracious to me and answer me.","When You say, Seek My face, / To You my heart says, Your face, O Jehovah, will I seek.","Do not hide Your face from me; / Do not turn Your servant away in Your anger; / You have been my help. / Do not abandon me or forsake me, / O God of my salvation.","If my father and my mother forsake me, / Jehovah will take me up.","Teach me, O Jehovah, Your way, / And lead me on a level path / Because of those who lie in wait for me.","Do not give me over / To the will of my adversaries; / For false witnesses have risen up against me, / And those who breathe out threats.","I have believed / That I would see the goodness of Jehovah / In the land of the living.","Wait for Jehovah; / Be strong, and let your heart be encouraged. / Yes, wait for Jehovah."],["To You, O Jehovah, do I call out; / My rock, do not be deaf to me, / Lest, if You are silent to me, / I become like those who go down into the pit.","Hear the voice of my supplications / When I cry out to You, / When I lift up my hands / Unto Your innermost sanctuary.","Do not drag me away with the wicked / And with the workers of iniquity, / Who speak peace to their neighbors / While evil is in their heart.","Repay them according to what they have done / And according to the evil of their deeds; / According to the work of their hands repay them; / Return to them their due.","For they do not regard the acts of Jehovah / Or the work of His hands; / He will tear them down / And not rebuild them.","Blessed be Jehovah, / For He has heard the voice of my supplications.","Jehovah is my strength and my shield; / My heart trusts in Him, and I am helped; / Therefore my heart exults; / And with my song do I give thanks to Him.","Jehovah is their strength; / And He is a stronghold of salvation to His anointed.","Save Your people, / And bless Your inheritance; / And shepherd them and carry them forever."],["Ascribe to Jehovah, O sons of the Mighty, / Ascribe to Jehovah glory and strength;","Ascribe to Jehovah the glory of His name; / Worship Jehovah in holy splendor.","The voice of Jehovah is over the waters; / The God of glory thunders, / Jehovah over the great waters.","The voice of Jehovah is powerful; / The voice of Jehovah is full of majesty.","The voice of Jehovah breaks the cedars; / Indeed Jehovah breaks the cedars of Lebanon in pieces;","And He makes Lebanon skip like a calf, / And Sirion like a young wild ox.","The voice of Jehovah cleaves out flames of fire.","The voice of Jehovah shakes the wilderness; / Jehovah shakes the wilderness of Kadesh.","The voice of Jehovah causes the hinds to calve / And strips the forests bare; / And in His temple all say, Glory!","Jehovah sat enthroned at the Flood, / And Jehovah sits as King forever.","May Jehovah give strength to His people. / May Jehovah bless His people with peace."],["I extol You, O Jehovah, for You have drawn me up / And have not let my enemies rejoice over me.","O Jehovah my God, / I cried out to You, / And You healed me.","O Jehovah, You have brought up my soul from Sheol; / You have preserved me alive that I would not go down into the pit.","Sing psalms to Jehovah, you who are His faithful ones; / And praise His holy memorial.","For His anger lasts but a moment, / His favor, a lifetime; / Weeping may linger in the evening, / But a ringing shout goes up in the morning.","As for me, I said in my prosperity, / I will never be shaken.","O Jehovah, by Your favor You had made my mountain stand strong. / You hid Your face; I was troubled.","To You, O Jehovah, I called out; / And to Jehovah I made my supplication.","What profit is there in my blood if I go down into the pit? / Will the dust praise You? Will it declare Your faithfulness?","Hear, O Jehovah, and be gracious to me. / O Jehovah, be my help.","You have turned for me my mourning into dancing; / You have loosened my sackcloth / And girded me with rejoicing,","That my glory might sing psalms to You and not be silent. / O Jehovah my God, I will praise You forever."],["In You, O Jehovah, do I take refuge; / Never let me be put to shame. / Rescue me in Your righteousness.","Incline Your ear to me; / Deliver me speedily. / Be to me a rock of protection, / A fortress, to save me.","For You are my crag and my fortress; / Therefore for Your name’s sake / Lead me and guide me.","Bring me out of the net / That they have secretly laid for me, / For You are my protection.","Into Your hand I commit my spirit; / Redeem me, O Jehovah, God of truth.","I hate those who regard vanities of falsehood, / But I trust in Jehovah.","I will exult and rejoice in Your lovingkindness, / Since You have seen my affliction; / You know the distress of my soul.","And You have not delivered me into the hand of the enemy; / You have made my feet stand in a place broad and free.","Be gracious to me, O Jehovah, for I am in distress. / My eye is wasted away with grief, / Indeed my soul and body.","For my life has been consumed in sorrow, / And my years, in sighing. / My strength fails because of my iniquity, / And my bones have wasted away.","Because of all my adversaries, / I have become a reproach, / And especially so to my neighbors, / And something dreaded to my acquaintances; / Those who see me on the street flee from me.","I am forgotten, like a dead man out of mind; / I am like a destroyed vessel.","For I hear the slander of many; / Terror is on every side. / When they take counsel together against me, / They scheme to take my life.","But I trust in You, O Jehovah; / I say, You are my God.","My times are in Your hand; / Deliver me from the hand of my enemies and from those who pursue me.","Cause Your face to shine upon Your servant; / Save me in Your lovingkindness.","O Jehovah, do not let me be put to shame when I call out to You; / Let the wicked be put to shame; let them be silent in Sheol.","Let the lips of falsehood be made dumb, / Which speak arrogantly against the righteous / With pride and contempt.","How great is Your goodness, / Which You have stored up for those who fear You, / Which You have accomplished in the sight of the sons of men / For those who take refuge in You!","You hide them in the hiding place of Your presence / Apart from the conspiracies of men; / You lay them away secretly in a shelter / Apart from the contention of tongues.","Blessed be Jehovah, / For He displayed His lovingkindness wondrously / To me in a fortified city.","I, on my part, had said in my alarm, / I am cut off before Your eyes; / But instead You heard / The voice of my supplications / When I cried out to You.","Love Jehovah, all you who are His faithful ones; / Jehovah guards the trustworthy, / And recompenses abundantly / Him who acts haughtily.","Be strong, and let your heart be encouraged, / All you who hope in Jehovah."],["Blessed is he whose transgression is forgiven; / Whose sin is covered.","Blessed is the man to whom / Jehovah does not impute iniquity / And in whose spirit there is no deceit.","When I kept silent, my bones wasted away / Through my groaning all day long.","For day and night Your hand / Was heavy upon me; / My life sap was dried up / As in the drought of summer. Selah","I acknowledged my sin to You, / And I did not cover my iniquity. / I said, I will confess my transgressions to Jehovah. / Then You forgave the iniquity of my sin. Selah","Because of this let everyone who is faithful / Pray to You at a time when You may be found; / Surely when great waters overflow, / They will not reach him.","You are my hiding place; / You preserve me from trouble; / You surround me with the ringing shouts of deliverance. Selah","I will instruct you and teach you concerning the way you should go; / I will counsel you; My eye is upon you.","Do not be like a horse or like a mule, without understanding; / Whose trappings consist of bit and bridle to restrain them, / Else they do not come near you.","Many are the sorrows that the wicked have; / But he who trusts in Jehovah is encompassed by lovingkindness.","Rejoice in Jehovah and exult, O righteous ones; / And give a ringing shout, all you who are upright in heart."],["Rejoice in Jehovah, O righteous ones. / Praise is becoming to the upright.","Give thanks to Jehovah with the lyre; / With the harp of ten strings sing psalms to Him.","Sing Him a new song; / Play skillfully with a joyous shout.","For the word of Jehovah is right, / And all His work is done in faithfulness.","He loves righteousness and justice; / The earth is full of the lovingkindness of Jehovah.","By the word of Jehovah the heavens were made, / And all their host, by the breath of His mouth.","He gathers the water of the sea like a heap; / He puts the deep waters into storage places.","Let all the earth fear Jehovah; / Let all the inhabitants of the world stand in awe of Him.","For He spoke, and it was; / He commanded, and it stood.","Jehovah brings the counsel of the nations to nothing; / He frustrates the intentions of the peoples.","The counsel of Jehovah stands forever; / The intentions of His heart stand from generation to generation.","Blessed is the nation whose God is Jehovah, / The people whom He has chosen as His own possession.","Jehovah looks from heaven; / He sees all the sons of men.","From the site of His habitation He gazes / At all the inhabitants of the earth,","He who fashions the hearts of them all, / He who discerns all their works.","No king is saved by a great army; / A mighty man is not delivered by great strength.","A horse is a vain thing for salvation, / And it cannot deliver by its great power.","Behold, the eye of Jehovah is upon those who fear Him, / Upon those who hope in His lovingkindness,","To deliver their soul from death / And to preserve them alive in famine.","Our soul waits on Jehovah; / He is our help and our shield;","For in Him our heart rejoices, / Because in His holy name we trust.","May Your lovingkindness, O Jehovah, be upon us, / Even as we have hoped in You."],["I will bless Jehovah at all times; / His praise will continually be in my mouth.","My soul makes its boast in Jehovah; / The lowly hear and they rejoice.","Magnify Jehovah with me, / And let us exalt His name together.","I sought Jehovah, and He answered me; / And He delivered me from all that terrified me.","They looked to Him and were radiant; / And their faces will never be abashed.","This poor man called out, and Jehovah heard; / And He saved him out of all his troubles.","The angel of Jehovah encamps / Around those who fear Him, and He delivers them.","Taste and see that Jehovah is good; / Blessed is the man who takes refuge in Him.","Fear Jehovah, you who are His saints; / For there is no lack with those who fear Him.","The young lions hunger and starve, / But those who seek Jehovah will not lack any good thing.","Come, children; hear me. / I will teach you the fear of Jehovah.","Who is the man who desires life, / Who loves having days in order to see good?","Guard your tongue from evil, / And your lips from speaking deceit.","Turn away from evil and do good; / Seek peace and pursue it.","The eyes of Jehovah are set toward the righteous, / And His ears, toward their cry.","The face of Jehovah is against those who do evil, / To cut off the memory of them from the earth.","The righteous cry out, and Jehovah hears; / And He saves them out of all their troubles.","Jehovah is near to those who are broken in heart, / And He saves those who are contrite in spirit.","Many are the troubles of the righteous man, / But Jehovah delivers him from all of them.","He keeps all his bones; / Not one of them is broken.","Evil will slay the wicked, / And those who hate the righteous man will be condemned.","Jehovah redeems the soul of His servants, / And none who take refuge in Him will be condemned."],["Strive, O Jehovah, with those who strive with me; / Battle against those who battle against me.","Take hold of buckler and shield, / And rise up as my help.","Draw out also the spear, and close up the way / Against those who pursue me; / Say to my soul, / I am your salvation.","Let those who seek my life / Be put to shame and humiliated; / Let those who devise evil for me / Be turned back and confounded.","Let them be like chaff before the wind, / With the angel of Jehovah driving them on.","Let their way be darkness and slipperiness itself, / With the angel of Jehovah pursuing them.","For without cause they hid their net for me; / Without cause they dug a pit for me.","Let destruction come upon him unawares, / And let his net, which he hid, catch him; / Let him fall into it, into destruction.","Then my soul will exult in Jehovah; / It will rejoice in His salvation.","All my bones will say, / Jehovah, who is like You, / Who delivers the poor from him who is too strong for him, / And the poor and needy from him who robs him?","Malicious witnesses rise up; / They ask me about things I know nothing of.","They repay me evil for good; / I am bereaved in soul.","But I, when they were sick, / Had sackcloth as my clothing; / I afflicted my soul with fasting, / And my prayer returned to my own bosom.","I conducted myself as if it had been my friend or my brother; / Like one mourning for his mother, I bowed down gloomily.","But at my stumbling they rejoice and gather together; / The attackers whom I did not know / Gather together against me; / They tear at me and do not cease.","As profane mocking parasites, / They gnash their teeth at me.","O Lord, how long will You look on? / Rescue my soul from their destruction, / My precious life from the lions.","I will give You thanks in the great congregation; / Among a mighty people I will praise You.","Do not let those who are wrongly my enemies rejoice over me; / Do not let those who hate me without cause narrow their eyes at me.","For they do not speak peace, / But devise words of deceit / Against the quiet people of the land.","And they open their mouth wide against me; / They say, Aha! Aha! Our eyes have seen it.","You have seen, O Jehovah; do not be silent. / O Lord, do not be far from me.","Awake, and stir Yourself for my cause, / For my claim, O my God and my Lord.","Vindicate me according to Your righteousness, O Jehovah my God; / And do not let them rejoice over me.","Do not let them say in their heart, / Aha! That is what we wanted. / Do not let them say, We have swallowed him up.","May those who rejoice at my trouble / Be ashamed and confounded together; / May those who magnify themselves against me / Be clothed with shame and humiliation.","May those who delight in the vindication of my righteousness / Give a ringing shout and rejoice, / And may they say continually, / Jehovah be magnified, / Who delights in the well-being of His servant.","And my tongue will declare Your righteousness / And Your praise all day long."],["Transgression speaks to the wicked / Within his heart; / There is no dread of God / Before his eyes.","For he flatters himself in his own eyes, / That his iniquity cannot be found out and hated.","The words of his mouth are wickedness and deceit; / He has ceased being wise and doing good.","He plans wickedness on his bed; / He sets himself on a way that is not good; / He does not reject evil.","O Jehovah, Your lovingkindness is in the heavens; / Your faithfulness reaches unto the skies.","Your righteousness is like the mountains of God; / Your judgments are like the great deep; / You preserve man and beast, O Jehovah.","How precious is Your lovingkindness, O God! / Thus the sons of men take refuge in the shadow of Your wings.","They are saturated with the fatness of Your house, / And You cause them to drink of the river of Your pleasures.","For with You is the fountain of life; / In Your light we see light.","Continue Your lovingkindness to those who know You, / And Your righteousness to those who are upright in heart.","Do not let the foot of the arrogant come upon me, / Nor let the hand of the wicked drive me away.","There the workers of iniquity are fallen; / They are cast down and unable to rise."],["Do not be incensed because of evildoers; / Do not be envious of wrongdoers.","For they soon wither like grass / And fade away like green herbage.","Trust in Jehovah, and do good; / Dwell in the land, and feed on His faithfulness.","Delight yourself in Jehovah, / And He will give you the requests of your heart.","Commit your way to Jehovah, / And trust in Him; and He will act.","And He will cause your righteousness to go forth like light, / And your justness like noonday.","Be still before Jehovah, and wait for Him; / Do not be incensed because of him who enjoys prosperity on his way, / Because of the man who performs his evil schemes.","Cease from anger and forsake wrath; / Do not be incensed; it leads only to evil.","For the evildoers will be cut off; / But those who wait on Jehovah, / They will inherit the land.","And in a little while longer there will be no wicked man; / Indeed, you will look diligently for his place, and he will not be there.","But the lowly will inherit the land / And delight themselves in the abundance of peace.","The wicked man makes evil schemes against the righteous man / And gnashes his teeth at him.","The Lord will laugh at him, / For He sees that his day will come.","The wicked have drawn out the sword / And bent their bow, / To cast the poor and the needy down, / To slaughter those who are upright in their way.","Their sword will enter their own heart, / And their bows will be broken.","Better is the little that the righteous man has / Than the abundance of many wicked.","For the arms of the wicked will be broken, / But Jehovah upholds the righteous.","Jehovah knows the days of the perfect, / And their inheritance will be forever.","They will not be put to shame in a time of evil, / And in the days of famine they will be satisfied.","But the wicked will perish, / And the enemies of Jehovah will be like the glory of the pastures: / They are consumed; in smoke they are consumed.","The wicked one borrows but does not repay, / But the righteous one is gracious and gives.","For those blessed by Him will inherit the land, / But those cursed by Him will be cut off.","A man’s steps are established by Jehovah, / And He delights in his way.","If he falls, he is not utterly cast down; / For Jehovah upholds him by the hand.","I was once a young man; now I am old. / Yet I have not seen the righteous man forsaken, / Nor his seed seeking bread.","He is always gracious and lends, / And his seed becomes a blessing.","Turn away from evil and do good, / And abide forever.","For Jehovah loves justice / And does not abandon His faithful ones; / They are kept forever; / But the seed of the wicked is cut off.","The righteous will inherit the land, / And they will abide in it forever.","The mouth of the righteous utters wisdom, / And his tongue speaks justice.","The law of his God is in his heart; / His steps do not slip.","The wicked man watches for the righteous man / And seeks to slay him.","Jehovah does not leave him in his hand, / Nor let him be condemned when he is judged.","Wait for Jehovah, / And keep His way; / And He will exalt you to inherit the land; / When the wicked are cut off, you will see it.","I have seen the wicked man terrorizing, / And spreading himself like a luxuriant native tree.","Then someone passes by, and behold, he is not there; / I search for him, and he is not found.","Observe the perfect man, and watch the upright man; / For there is a future for the man of peace.","But the transgressors will be altogether destroyed; / The future of the wicked will be cut off.","And the salvation of the righteous is from Jehovah; / He is their stronghold in a time of distress.","And Jehovah helps them and rescues them; / He rescues them from the wicked, / And saves them, for they take refuge in Him."],["O Jehovah, do not rebuke me in Your indignation, / Nor chasten me in Your burning wrath.","For Your arrows have sunk deep in me, / And Your hand has come down heavy upon me.","There is no soundness in my flesh due to Your indignation; / There is no wholeness in my bones due to my sin.","For my iniquities have passed over my head; / Like a heavy burden, they are too heavy for me.","My wounds are odious and festering / Due to my foolishness.","I am bent down and bowed utterly; / I go about all day long mourning.","For my loins are filled with burning, / And there is no soundness in my flesh.","I am benumbed and crushed utterly; / I cry out due to the groaning of my heart.","O Lord, all my desire is before You, / And my groaning is not hidden from You.","My heart throbs; my strength fails me; / And as for the light of my eyes, neither is it with me.","Those who love me and those who are my friends stand aloof from my plague, / And my relatives stand far away.","And those who seek my soul lay traps for me, / And those who pursue my misfortune speak of destruction, / And they contemplate deceit all day long.","But I, like a deaf man, cannot hear; / And I am like a dumb man, who cannot open his mouth.","Indeed I am like a man who does not hear / And in whose mouth there are no reproofs.","For in You, O Jehovah, do I hope; / You will respond, O Lord my God.","For I said, May they never rejoice over me! / When my foot slips, they magnify themselves over me.","For I am ready to stumble, / And my pain is before me continually.","For I declare my iniquity; / I am anxious because of my sin.","But my enemies are vigorous; they are strong; / And those who wrongly hate me are many.","Those also who repay evil for good / Are my adversaries because I pursue what is good.","Do not abandon me, O Jehovah; / O my God, do not be far away from me.","Hasten to help me, / O Lord, my salvation."],["I said, I will keep my ways, / So that I do not sin with my tongue; / I will keep a muzzle on my mouth / When the wicked are before me.","I was dumb and silent; / I held my peace, even from good; / And my pain was stirred up.","My heart was hot within me; / While I mused, the fire burned; / I spoke with my tongue:","O Jehovah, cause me to know my end, / And the measure of my days, what it is. / May I know how transient I am.","Behold, You have made my days as mere handbreadths, / And my lifetime is as nothing before You; / Surely every man at his best is altogether vanity. Selah","Surely man goes about as a semblance; / Surely they bustle about in vain: / He heaps up riches yet knows not / Who will gather them.","And now what am I waiting for, O Lord? / My hope — it is in You.","Deliver me from all my transgressions; / Do not make me the fool’s reproach.","I was dumb; I did not open my mouth; / For You have done this.","Remove Your plague from me; / By the hostility of Your hand I am consumed.","With rebukes You chasten a man because of iniquity, / And cause what is desirous to him to disappear like a moth. / Surely every man is vanity. Selah","Hear my prayer, O Jehovah; / And give ear to my cry; / Do not hold Your peace at my tears. / For I am a stranger with You, / A sojourner, as all my fathers were.","Look away from me, that I may be cheerful, / Before I go away and am no more."],["I waited patiently on Jehovah, / And He inclined to me / And heard my cry.","Then He brought me up out of a pit of destruction, / Out of the miry clay; / And He set my feet upon a rock, / Establishing my steps.","Then He put a new song in my mouth, / A praise to our God. / Many see it and fear, / And they trust in Jehovah.","Blessed is the man / Who makes Jehovah his trust / And does not turn to the proud / Or to those who turn aside after deception.","Many, O Jehovah my God, are the wonderful deeds which You have done / And Your thoughts toward us; / They cannot be set in order unto You. / Were I to declare and speak of them, / They would be too numerous to recount.","You do not delight in sacrifice and offering; / You have prepared ears for Me; / You do not require burnt offering and sin offering.","Then I said, / Behold, I have come; / In the scroll of the book / It is written concerning Me.","I delight in doing Your will, O My God; / Indeed Your law is within My inward parts.","I bear tidings of righteousness / In the great congregation. / Behold, I will not withhold My lips; / O Jehovah, You know.","I have not hidden Your righteousness / Within My heart; / I have declared Your faithfulness and Your salvation; / I have not concealed Your lovingkindness and Your truth from the great congregation.","You, O Jehovah, do not withhold / Your compassions from me; / May Your lovingkindness and Your truth / Preserve me continually.","For evils encompass me until they cannot be counted; / My iniquities have so overtaken me / That I cannot see; / They are more numerous than the hairs of my head; / Thus my heart fails me.","Be pleased, O Jehovah, to deliver me; / O Jehovah, hasten to help me.","May those who seek my life to destroy it / Be put to shame and confounded together; / May those who take delight in my misfortune / Be turned back and humiliated.","May those who say to me, Aha! Aha! / Be desolate because of their shame.","May all those who seek You / Be glad and rejoice in You; / May those who love Your salvation say continually, / May Jehovah be magnified!","But I am poor and needy; / May the Lord think about me. / You are my help and my Deliverer; / O my God, do not delay."],["Blessed is he who considers the poor; / In the day of evil Jehovah will deliver him.","May Jehovah keep him and preserve him alive; / May he be blessed in the land; / And do not give him over to the will of his enemies.","Jehovah will sustain him on his sickbed; / You make all his bed in his illness.","I said, O Jehovah, be gracious to me; / Heal my soul, for I have sinned against You.","My enemies speak evil against me: / When will he die and his name perish?","And if he comes to see me, he speaks falsehood. / His heart gathers iniquity to itself; / When he goes out, he speaks it.","All who hate me whisper together against me; / Against me they devise my misfortune.","Some evil illness, they say, has been poured out on him; / And when he lies down, he will not rise again.","Even my familiar friend, in whom I trusted, / Who ate my bread, has lifted his heel against me.","But You, O Jehovah, be gracious to me and raise me up / That I may recompense them.","By this I know that You delight in me, / That my enemy has not shouted in triumph over me.","And as for me, You uphold me in my integrity, / And You set me in Your presence forever.","Blessed be Jehovah the God of Israel, / From eternity to eternity. / Amen and Amen."],["As the hart pants / After the streams of water, / So my soul pants / For You, O God.","My soul thirsts for God, / For the living God. / When will I come and appear / Before God?","My tears have been my food / Day and night, / While they say to me all day long, / Where is your God?","These things I remember, / And I pour out my soul within me: / That I passed through with the throng; / I led them to the house of God / With the voice of a joyous shout and praise, / The festal multitude.","Why are you cast down, O my soul? / And why are you disquieted within me? / Hope in God, for I will yet praise Him / For the salvation of His countenance.","O my God, my soul is cast down within me; / Therefore I remember You / From the land of the Jordan and the Hermons, / From Mount Mizar.","Deep calls unto deep / At the sound of Your water spouts; / All Your waves and Your billows / Pass over me.","By day Jehovah commands / His lovingkindness, / And by night His song is with me, / A prayer to the God of my life.","I say to God my rock, / Why have You forgotten me? / Why do I go mourning / Because of the oppression of the enemy?","As with a shattering in my bones, / My adversaries reproach me, / While they say to me all day long, / Where is your God?","Why are you cast down, O my soul? / And why are you disquieted within me? / Hope in God, for I will yet praise Him, / The salvation of my countenance and my God."],["Render judgment for me, O God; / And plead my cause / Before an unfaithful nation; / From the deceitful and unjust man / Deliver me.","For You are the God of my protection. / Why have You rejected me? / Why do I go about mourning / Because of the oppression of the enemy?","Send forth Your light and Your truth; / They will lead me; / They will bring me to Your holy mountain / And to Your tabernacles.","And I will go to the altar of God, / To God my exceeding joy; / And I will praise You with the harp, / O God, my God.","Why are you cast down, O my soul? / And why are you disquieted within me? / Hope in God, for I will yet praise Him, / The salvation of my countenance and my God."],["O God, we have heard with our ears; / Our fathers have recounted it to us, / The work You did in their days, / In the days of old.","You, by Your hand, / Have dispossessed nations, but You have planted our fathers; / You afflicted peoples, but You spread our fathers forth.","For they did not possess the land by their sword, / Nor did their arm save them; / Rather it was Your right hand and Your arm, / And the light of Your countenance; / For You delighted in them.","You are my King, O God; / Command salvation for Jacob.","Through You we thrust back our adversaries; / Through Your name we trample those who rise up against us.","For I will not trust in my bow, / Nor will my sword save me.","But You save us from our adversaries, / And You put to shame those who hate us.","In God we boast all day long, / And we praise Your name forever. Selah","Nevertheless You have rejected us and humiliated us, / And You have not gone forth with our armies.","You have caused us to turn back from the adversary, / And those who hate us take spoil for themselves.","You have given us over like sheep to be eaten / And have scattered us among the nations.","You have sold Your people for nothing / And have not gone high on their price.","You have made us a reproach to our neighbors, / A mocking and a derision to those around us.","You have made us a proverb among the nations, / Something to shake the head at among the peoples.","All day long my humiliation is before me, / And the shame of my face covers me,","Because of the voice of him who reproaches and reviles, / Because of the presence of the enemy and of him who avenges himself.","All this has come upon us; but we have not forgotten You, / Nor have we been false to Your covenant.","Our heart has not turned back, / Nor have our steps deviated from Your way;","But You have crushed us in the place of jackals / And have covered us with the shadow of death.","If we have forgotten the name of our God / Or spread out our hands to a strange god,","Will God not search this out? / For He knows the hidden things of the heart.","But for Your sake we are slain all day long; / We are considered as sheep for slaughter.","Awake! Why are You sleeping, O Lord? / Arise! Do not reject us forever.","Why do You hide Your face / And forget our affliction and our oppression?","For our soul bows down to the dust; / Our body clings to the earth.","Rise up; be our help, / And redeem us for Your lovingkindness’ sake."],["My heart overflows with a good matter; / I speak what I have composed concerning the King. / My tongue is the pen of a ready writer.","You are fairer than the sons of men; / Grace is poured upon Your lips; / Therefore God has blessed You forever.","Gird Your sword upon Your thigh, O mighty One, / In Your majesty and Your splendor.","And in Your splendor ride on victoriously / Because of truth and meekness and righteousness; / And let Your right hand teach You awesome deeds.","Your arrows are sharp: / The peoples fall under You; / The arrows are in the heart of the King’s enemies.","Your throne, O God, is forever and ever; / The scepter of uprightness is the scepter of Your kingdom.","You have loved righteousness and hated wickedness; / Therefore God, Your God, has anointed You / With the oil of gladness above Your companions.","All Your garments smell of myrrh and aloes, of cassia; / From palaces of ivory, harpstrings have made You glad.","The daughters of kings are among Your most prized; / The queen stands at Your right hand in the gold of Ophir.","Hear, O daughter, and see; and incline your ear; / And forget your people and your father’s house;","Thus the King will desire your beauty. / Because He is your Lord, / Worship Him.","And the daughter of Tyre will come with a gift; / The rich among the people will entreat your favor.","The king’s daughter is all glorious within the royal abode; / Her garment is a woven work inwrought with gold.","She will be led to the King in embroidered clothing; / The virgins behind her, her companions, / Will be brought to You.","They will be led with rejoicing and exultation; / They will enter the King’s palace.","In the place of Your fathers will be Your sons; / You will make them princes in all the earth.","I will cause Your name to be remembered in all generations; / Therefore the peoples will praise You forever and ever."],["God is our refuge and strength; / A help in distress, He is most readily found.","Therefore we will not fear, / Though the earth change, / And the mountains slip into the heart of the seas;","Though the waters of the sea roar and foam; / Though the mountains shake at its swelling. Selah","There is a river whose streams gladden the city of God, / The holy place of the tabernacles of the Most High.","God is in the midst of her; she will not be moved; / God helps her at the dawn of the morning.","The nations rage; the kingdoms are moved. / He utters His voice; the earth melts.","Jehovah of hosts is with us; / The God of Jacob is our high retreat. Selah","Come, see the works of Jehovah, / How He has made desolations on earth.","He makes wars cease unto the end of the earth; / He breaks the bow and cuts the spear to pieces; / He burns the war wagons with fire.","Be still and know that I am God. / I will be exalted among the nations; I will be exalted on earth.","Jehovah of hosts is with us; / The God of Jacob is our high retreat. Selah"],["Clap your hands, all you peoples; / Shout to God with the voice of a triumphant sound.","For Jehovah Most High is awesome: / A great King over all the earth.","He subdues peoples under us, / And nations under our feet.","He chose our inheritance for us, / The excellency of Jacob, whom He loved. Selah","God ascends amidst shouting; / Jehovah, at the sound of a trumpet.","Sing psalms to God, sing psalms; / Sing psalms to our King, sing psalms.","For God is the King of all the earth; / Sing psalms with understanding.","God reigns over the nations; / God sits upon His holy throne.","The princes of the peoples have been gathered / As the people of the God of Abraham; / For the shields of the earth belong to God; / He is greatly exalted."],["Great is Jehovah, / And much to be praised / In the city of our God, / In His holy mountain.","Beautiful in elevation, / The joy of the whole earth, / Is Mount Zion, the sides of the north, / The city of the great King.","God has made Himself known / In her palaces as a high retreat.","For, behold, the kings have assembled themselves; / They passed by together.","They saw; therefore they were astounded. / They were dismayed; they hurried off in alarm.","Trembling seized them there; / Writhing, like that of a woman in labor;","With an east wind You shattered / The ships of Tarshish.","As we have heard, / So we have seen / In the city of Jehovah of hosts, / In the city of our God. / God will establish her forever. Selah","We consider, O God, Your lovingkindness / In the midst of Your temple.","As Your name is, O God, / So is Your praise / Unto the ends of the earth; / Your right hand is full of righteousness.","Let Mount Zion rejoice; / Let the daughters of Judah exult / Because of Your judgments.","Walk about Zion, and go around her; / Count her towers.","Consider carefully her bulwarks; / Pass between her palaces; / That you may recount it to the generation following.","For this God is our God forever and ever. / He will guide us even unto death."],["Hear this, all you peoples; / Give ear, all you inhabitants of the world,","Both low and high, / Rich and poor together;","My mouth will speak wisdom, / And the meditation of my heart will be that of understanding.","I will incline my ear to a parable; / I will disclose my riddle upon the harp.","Why should I fear in the days of evil, / When the iniquity of those who supplant me surrounds me,","Those who trust in their wealth / And boast in the multitude of their riches?","None can by any means redeem his brother / Or give to God a ransom for him","(For the redemption of their soul is costly / And must be given up forever),","That he would yet live always / And not see corruption.","For he will see that wise men die; / The foolish one and the senseless one perish alike / And leave their wealth to others.","Their inward thought is that their houses will remain forever, / That their habitations will remain from generation to generation; / They call lands after their own names.","But man in honor does not remain; / He is like the beasts that perish.","Such is the way of those who are self-confident, / And of those after them who approve of their sayings. Selah","Like a flock, they are appointed for Sheol; / Death will shepherd them. / And straight to the grave they will descend, / And their form will be for Sheol to consume / That there be no abode for them.","But God will redeem my soul / From the power of Sheol, / For He will receive me. Selah","Do not fear when a man becomes rich, / When the glory of his house increases.","For when he dies, he will take nothing; / His glory will not descend after him.","Though he blessed his soul while he lived — / And men praise you when you do good for yourself — ","It will go to the generation of his fathers; / They will never see light.","A man in honor but without understanding / Is like the beasts that perish."],["The Mighty One, God Jehovah, / Speaks and summons the earth / From the rising of the sun to its setting.","Out of Zion, the perfection of beauty, / God shines forth.","Our God has come and will not be silent; / Fire devours before Him, / And around Him it is exceedingly tempestuous.","He calls to the heavens above, / And to the earth that He may judge His people:","Gather My saints to Me, / Those who have made a covenant with Me by sacrifice.","Then the heavens declare His righteousness, / For God Himself is Judge. Selah","Hear, O My people, and I will speak; / O Israel, and I will testify against you: / I am God, your God.","I will not reprove you because of your sacrifices, / And your burnt offerings are before Me continually.","I will not take a bull from your house / Nor goats from your folds,","For every animal of the forest is Mine, / The cattle upon a thousand hills.","I know every bird of the mountains, / And I am aware of everything that moves in the field.","If I were hungry, I would not tell you; / For the world is Mine and the fullness thereof.","Shall I eat the flesh of bulls / Or drink the blood of goats?","Offer to God a sacrifice of thanksgiving, / And repay your vows to the Most High;","And call upon Me in the day of trouble: / I will deliver you, and you will glorify Me.","But to the wicked God says, / What right do you have to declare My statutes / And take up My covenant in your mouth,","Seeing that you hate correction / And cast My words behind you?","When you see a thief, you take pleasure in him; / And your portion is with adulterers.","You let your mouth loose for evil, / And your tongue frames deceit.","You sit and speak against your brother; / You defame the son of your mother.","These things you do, and I keep silent; / You think that I am altogether like you. / I will rebuke you and set forth the matter in order before your eyes.","Consider this then, you who forget God, / Lest I tear you apart and there be none to deliver you.","Whoever offers a sacrifice of thanksgiving glorifies Me; / And to him who sets his way right I will show the salvation of God."],["Be gracious to me, O God, according to Your lovingkindness; / According to the greatness of Your compassions blot out my transgressions.","Wash me thoroughly from my iniquity, / And from my sin cleanse me.","For I do know my transgressions, / And my sin is before me continually.","Against You and You alone have I sinned, / And I have done what is evil in Your sight. / Therefore You are righteous when You speak; / You are clear when You judge.","Behold, I was brought forth in iniquity, / And in sin did my mother conceive me.","Behold, You delight in truth in the inward parts; / And in the hidden part You would make known wisdom to me.","Purge my sin with hyssop, and I will be clean; / Wash me, and I will be whiter than snow.","Let me hear gladness and joy, / That the bones which You have broken may exult.","Hide Your face from my sins, / And blot out all my iniquities.","Create in me a clean heart, O God, / And renew a steadfast spirit within me.","Do not cast me from Your presence, / And do not take the Spirit of Your holiness away from me.","Restore to me the gladness of Your salvation, / And sustain me with a willing spirit.","I will teach transgressors Your ways, / And sinners will turn back to You.","Deliver me from the guilt of bloodshed, O God, O God of my salvation; / And my tongue will ring forth Your righteousness.","O Lord, open my lips, / And my mouth will declare Your praise.","For You do not delight in sacrifice; / Otherwise I would offer it; / You take no pleasure in burnt offerings.","The sacrifices of God are a broken spirit; / A broken and a contrite heart, O God, You will not despise.","Do good in Your good pleasure unto Zion; / Build the walls of Jerusalem.","Then You will delight in the sacrifices of righteousness, / In burnt offerings and whole burnt offerings; / Then they will offer bulls upon Your altar."],["Why do you boast in evil, O mighty one? / God’s lovingkindness endures continually.","Your tongue devises destruction; / It is like a sharpened razor, O worker of deceit.","You have loved evil rather than good, / Falsehood rather than speaking righteousness. Selah","You have loved all the devouring words, / O deceitful tongue.","God will likewise break you down forever; / He will take you and pluck you up from your tent, / And uproot you from the land of the living. Selah","And the righteous will see it and fear, / And they will laugh at him, saying,","Behold, this is that mighty man / Who did not make God his strength, / But trusted in the multitude of his riches / And strengthened himself in his desire.","But I, like a flourishing olive tree / In the house of God, / Trust in God’s lovingkindness / Forever and ever.","I will give You thanks forever, / For You have acted; / And I will hope in Your name in the presence of Your faithful ones, / For it is good."],["The fool has said in his heart, / There is no God. / They are corrupt and commit abominable deeds; / There is none who does good.","God looked down from heaven / Upon the sons of men / To see if there was anyone who had insight, / Who seeks after God.","All of them have turned back; / They are together perverse. / There is none who does good; / There is not even one.","Have they no knowledge, the workers of iniquity, / Who eat up my people as they would eat up bread / And do not call upon God?","There they were in great fear, / Where there was no fear. / For God scattered the bones / Of him who encamped against you. / You put them to shame / Because God has rejected them.","Oh that the salvation of Israel might come forth from Zion! / When God turns the captivity of His people, / Jacob will exult, Israel will rejoice."],["O God, save me by Your name, / And execute judgment for me by Your might.","O God, hear my prayer; / Give ear to the words of my mouth.","For strangers have risen up against me, / And those who terrorize seek my life; / They do not set God before them. Selah","Behold, God is my Helper; / The Lord is among those who sustain my soul.","He will return the evil to those who lie in wait for me. / Annihilate them in Your faithfulness.","I will offer a freewill offering to You; / I will praise Your name, O Jehovah, for it is good.","For He has delivered me from all distress, / And my eye looks triumphantly upon my enemies."],["Give ear, O God, to my prayer; / And do not hide Yourself from my supplication.","Give heed to me, and answer me. / I grow restless in my complaint and moan,","Because of the voice of the enemy, / Because of the oppression of the wicked man; / For they drop iniquity upon me, / And in anger they make me their enemy.","My heart writhes within me, / And the terrors of death have fallen upon me.","Fear and trembling have come upon me, / And shuddering overwhelms me.","And I say, Oh that I had wings like a dove! / Then I would fly away and be at rest.","Indeed I would wander far away; / I would lodge in the wilderness. Selah","I would hasten my escape / From the storm wind and the tempest.","Confuse, O Lord, divide their tongue; / For I have seen violence and contention in the city.","Day and night they go around it, / Upon its walls; / And iniquity and trouble are in the midst of it.","Utter ruin is in the midst of it, / And oppression and deceit / Do not depart from its streets.","For it is not an enemy who reproaches me; / Otherwise I could bear it. / It is not he who hates me who magnifies himself against me; / Otherwise I could hide myself from him.","But it is you, my equal, / My close friend and my acquaintance.","We were in sweet counsel together; / We walked with the throng in the house of God.","Let death surprise them; / May they go down into Sheol alive. / For evil is in their dwelling, in the midst of them.","As for me, I call out to God, / And Jehovah will save me.","Evening and morning and at noontime / I complain and moan, / And He hears my voice.","He has redeemed my soul in peace / From the battle against me, / For many are they who strive with me.","God hears and answers them — / Even He who sits enthroned from of old — Selah / Because with them there is no change, / And they do not fear God.","He put forth his hands against those who were at peace with him; / He profaned his covenant.","Smooth were the buttery words of his mouth, / But his heart was war; / More soothing than oil were his words, / But they were in fact drawn swords.","Cast your burden upon Jehovah, / And He will sustain you; / He will never allow the righteous to be moved.","But You, O God, will bring them down / Into the pit of decay. / Men of bloodshed and deceit / Will not live out half their days; / But I will trust in You."],["Be gracious to me, O God; for man tramples me; / All day long he, fighting, oppresses me.","Those who lie in wait for me trample me all day long, / For many are those who arrogantly fight against me.","When I am afraid, / I trust in You.","In God, whose word I praise, / In God do I trust, and I will not be afraid. / What can flesh do to me?","All day long they wrest my words; / All their thoughts are against me for evil.","They gather themselves; they lurk; / They watch my steps, / As they have waited to take my life.","Will there be deliverance for them in spite of their iniquity? / In anger cast down the peoples, O God.","You have counted my wanderings. / Put my tears into Your bottle. / Are they not in Your book?","Then my enemies will turn back / When I call; / This I know, / That God is for me.","In God, whose word I praise, / In Jehovah, whose word I praise,","In God do I trust; I will not be afraid. / What can man do to me?","Your vows, O God, are on me; / I will render thank offerings to You.","For You have delivered my soul from death, / Indeed, my feet from stumbling, / That I may walk before God / In the light of the living."],["Be gracious to me, O God, be gracious to me; / For my soul takes refuge in You; / Indeed in the shadow of Your wings I will take refuge, / Until the destruction passes by.","I call out to God the Most High, / To the God who accomplishes all things for me.","He sends forth from heaven and saves me; / He reproaches him who would trample me; Selah / God sends forth / His lovingkindness and His faithfulness.","My soul is among lions; / I lie down among those who blaze forth, the sons of men, / Whose teeth are spears and arrows, / And whose tongue is a sharp sword.","Be exalted above the heavens, O God; / Let Your glory be above all the earth.","They have prepared a net for my steps; / My soul is bowed down. / They have dug a pit before me; / They have fallen into it themselves. Selah","My heart is steadfast, O God; / My heart is steadfast. / I will sing, indeed I will sing psalms.","Awake, my glory; / Awake, O harp and lyre! / I will awaken the dawn.","I will give thanks to You among the peoples, O Lord; / I will sing psalms to You among the nations.","For Your lovingkindness is as great as the heavens; / And Your faithfulness reaches unto the skies.","Be exalted above the heavens, O God; / Let Your glory be above all the earth."],["Do you indeed, O judges, speak righteousness? / Do you judge in uprightness, O sons of men?","No, in heart you perform injustice; / You weigh out the violence of your hands on earth.","The wicked are estranged from the womb; / They err from their birth, speaking lies.","Their venom is like the venom of a serpent; / They are like the deaf cobra that has shut its ear,","Which does not hear the sound of the charmers / Or the wise spellbinder.","O God, break their teeth in their mouth; / Break off the fangs of the young lions, O Jehovah.","Let them melt like water that runs off. / When he shoots his arrows, / Let them be as though they were cut off.","Let them be like a snail that melts and goes away, / Like a woman’s miscarriage, which by no means sees the sun.","Before your pots can feel the fire of the thorns, / Whether green or burning, He will sweep them away.","The righteous man will rejoice when he sees vengeance; / He will wash his feet in the blood of the wicked.","And men will say, Indeed there is fruit for the righteous man; / Indeed there is a God who judges on earth."],["Deliver me from my enemies, O my God; / Set me on high, secure from those who rise up against me.","Deliver me from the workers of iniquity, / And save me from men of bloodshed.","For behold, they lie in wait for my soul; / The strong gather themselves against me. / Not because of any transgression of mine nor because of any sin of mine, O Jehovah,","Not for any fault of mine, they run and ready themselves; / Awake to meet me, and see.","Indeed You, O Jehovah, God of hosts, God of Israel, / Arise to punish all the nations; / Have no mercy upon any who treacherously commit iniquity. Selah","They return in the evening; / They growl like a dog / And go around the city.","Behold, they belch forth with their mouth; / Swords are in their lips; / For, Who, they say, hears?","But You, O Jehovah, laugh at them; / You have all the nations in derision.","O my strength, I will watch for You; / For God is my high retreat.","My God in His lovingkindness will meet me; / God will let me look triumphantly upon those who lie in wait for me.","Do not slay them, lest my people forget; / Scatter them by Your power, and bring them down, / O Lord our shield.","For the sin of their mouth, / For the word of their lips, / Let them even be taken in their arrogance, / And because of the cursing and the lying that they speak.","Consume them in wrath; consume them so that they are no more; / And men will know that God rules in Jacob / Unto the ends of the earth. Selah","They return in the evening; / They growl like a dog / And go around the city.","They wander about for food; / And if they are not filled, they linger.","But I will sing of Your strength; / And I will joyfully sing of Your lovingkindness in the morning. / For You have been my high retreat / And a refuge in the day of my distress.","O my strength, unto You I will sing psalms, / For God is my high retreat, / My God of lovingkindness."],["O God, You have rejected us; You have broken out upon us; / You have been angry. Restore us.","You have caused the earth to quake; You have split it open. / Heal the breaks in it, for it totters.","You have shown Your people hard things; / You have made us drink wine to stagger us.","You have given a banner to those who fear You, / To be displayed because of the truth. Selah","That Your beloved ones may be delivered, / Save with Your right hand, and answer us.","God has spoken in His holiness: I will exult; / I will divide Shechem / And measure out the Valley of Succoth.","Gilead is Mine, and Manasseh is Mine, / And Ephraim is the helmet for My head; / Judah is My scepter.","Moab is My washbowl; / Upon Edom I will cast My sandal; / Philistia, shout aloud because of Me.","Who will bring me into the besieged city? / Who will lead me to Edom?","Will not You, O God, who rejected us / And who did not go forth, O God, with our armies?","Give us help from the adversary, / For a salvation by man is vain.","In God we will do valiantly, / And it is He who will tread down our adversaries."],["Hear, O God, my cry; / Give heed to my prayer.","From the end of the earth / I will call out unto You / When my heart faints; / Lead me to the rock that is higher than I.","For You are a refuge to me, / A strong tower before the enemy.","Let me sojourn in Your tent forever; / Let me take refuge in the covering of Your wings. Selah","For You, O God, have heard my vows; / You have given me the inheritance of those who fear Your name.","You will add days to the days of the king; / May his years be like generation after generation.","May he dwell forever before God; / Appoint lovingkindness and faithfulness, that they may preserve him.","So I will sing psalms to Your name forever, / As I repay my vows day by day."],["My soul waits in silence for God alone; / My salvation is from Him.","He alone is my rock and my salvation, / My high retreat; I will not be greatly shaken.","How long will you assail a man / So that you may slay him, all of you, / Like a leaning wall or a tottering fence?","They only make plans to thrust him down from his dignity; / They take delight in lies; / With their mouth they bless, / But inwardly they curse. Selah","My soul, wait in silence for God alone, / For my expectation is from Him.","He alone is my rock and my salvation, / My high retreat; I will not be shaken.","On God my salvation and my glory depend; / The rock of my strength, my refuge, is in God.","Trust in Him at all times, O people; / Pour out your heart before Him; / God is a refuge to us. Selah","Men of low degree are but a vapor; / Men of high degree, a lie. / In the balances they go up; / Together they are less than a vapor.","Do not trust in oppression, / And do not vainly hope in robbery; / If wealth increases, / Do not set your heart on it.","Once has God spoken; / Twice have I heard this, / That strength belongs to God.","To You also, O Lord, belongs lovingkindness; / For You repay every man according to his work."],["O God, You are my God; I seek You diligently. / My soul thirsts for You, / My flesh faints in longing for You, / In a dry and weary land without water.","So I have looked upon You in the sanctuary, / Seeing Your power and Your glory.","Because Your lovingkindness is better than life, / My lips praise You.","Thus I bless You while I live; / I lift up my hands in Your name.","My soul is satisfied as with the rich fatness, / And my mouth praises You with lips of joyous shouting,","When I remember You while on my bed, / When I consider You in the night watches.","For You have been my help, / And in the shadow of Your wings I will shout for joy.","My soul pursues after You; / Your right hand upholds me.","But those who seek my life to destroy it / Will go into the lower parts of the earth;","They will be given over to the power of the sword; / They will be the portion of foxes.","But the king will rejoice in God; / Everyone who swears by Him will boast; / For the mouth of those who speak falsehood will be stopped."],["Hear, O God, my voice in my complaint; / Preserve my life from the enemy’s dread.","Hide me from the secret counsel of evildoers, / From the throng of the workers of iniquity,","Who have sharpened their tongue like a sword, / Who have aimed their arrow, their bitter word,","To shoot in secret places at the perfect man. / They shoot suddenly at him and do not fear.","They firm up for themselves an evil matter; / They talk of laying snares secretly; / They say, Who will see them?","They seek out injustices, saying: / We have completed a carefully sought-out plan. / Indeed each man’s inward thought / And heart are deep.","But God will shoot an arrow at them; / Suddenly they are wounded.","They are made to stumble over each other by their own tongue; / All who see them shake their heads.","And all men will fear / And declare what has been done by God, / And they will ponder His work.","The righteous man will rejoice in Jehovah and take refuge in Him, / And all the upright in heart will boast."],["Praise befits You, O God, in Zion; / And to You is the vow paid.","O You who hear prayer, / To You all flesh comes.","Iniquities prevail against me; / As for our transgressions, You make propitiation for them.","Blessed is he whom You have chosen and bring near / To dwell in Your courts. / We will be satisfied with the goodness of Your house, / Of Your holy temple.","By awesome deeds You answer us in righteousness, / O God of our salvation, / You who are the trust of all the ends of the earth / And of the remotest sea;","Who established the mountains in His strength, / Girded with might;","Who stilled the roaring of the seas, / The roaring of their billows, / And the tumult of the peoples.","And they who dwell in the uttermost parts / Are afraid of Your signs; / You make the exitways of the morning and the evening / Shout for joy.","You visit the earth and water it; / You enrich it greatly: / The river of God is full of water. / You provide men grain, for so You have prepared the earth.","Saturating its furrows, settling its ridges, / You soften it with showers; / You bless its sprouting forth.","You place a crown on a year with Your goodness, / And Your wagon tracks drop fatness;","The wilderness pastures overflow, / And the hills gird themselves with exultation.","The meadows are clothed with the flock, / And the valleys cover themselves in grain; / They shout for joy; indeed they sing."],["Shout joyfully to God, all the earth;","Sing forth the glory of His name; / Make glorious His praise.","Say to God, How awesome are Your deeds! / Because of the greatness of Your strength, Your enemies come cringing to You.","All the earth will worship You / And sing psalms to You; / They will sing psalms to Your name. Selah","Come and see the works of God; / He is awesome in His deeds toward the sons of men.","He turned the sea into dry land; / Through the river they crossed on foot. / There we rejoiced in Him.","He rules by His might forever; / His eyes observe the nations: / Let not the rebellious exalt themselves. Selah","Bless our God, O peoples; / And make the voice of His praise heard,","Who has kept our soul in life / And does not allow our feet to slip.","For You have tried us, O God; / You have refined us as silver is refined.","You have brought us into the net; / You have put a heavy burden on our loins.","You have made men ride over our heads; / We have gone through fire and water; / But You have brought us forth into abundance.","I will come into Your house with burnt offerings; / I will pay my vows to You,","Which my lips uttered / And my mouth spoke when I was in distress.","I will offer to You burnt offerings of fatlings / With the smoke of rams; / I will offer cattle with goats. Selah","Come, hear, all you who fear God, / And I will recount what He has done for my soul.","To Him I called out with my mouth, / And He was extolled with my tongue.","If I regarded iniquity in my heart, / The Lord did not hear.","But indeed God has heard; / He has given heed to the voice of my prayer.","Blessed be God, / Who has not turned my prayer away / Nor His lovingkindness from me."],["God be gracious to us and bless us; / May He make His face shine upon us; Selah","That Your way may be known on earth, / And Your salvation among all the nations.","Let the peoples praise You, O God; / Let the peoples praise You, all of them.","Let the nations rejoice and shout for joy, / For You will judge the peoples equitably / And will guide the nations on the earth. Selah","Let the peoples praise You, O God; / Let the peoples praise You, all of them.","The earth has yielded its increase; / God, our God, blesses us.","God blesses us; / And all the ends of the earth will fear Him."],["Let God arise; let His enemies be scattered; / And let those who hate Him flee before Him.","As smoke is driven away, You will drive them away; / As wax melts before fire, / The wicked will perish before God.","But the righteous will rejoice; they will exult before God / And be glad with rejoicing.","Sing to God; sing psalms to His name; / Triumph in Him who rides through the deserts — / For Jah is His name — and exult before Him.","A Father to the orphans and a Judge for the widows / Is God in His holy habitation.","God causes the solitary to dwell in a household; / He brings the prisoners forth into prosperity; / But the rebellious dwell in a parched land.","O God, when You went forth before Your people, / When You marched through the desert, Selah","The earth trembled, the heavens also dripped, / At the presence of God; / Sinai there quaked / At the presence of God, the God of Israel.","You shed forth bountiful rain, O God; / You confirmed Your inheritance when it languished.","Your living flock dwelt in the land; / In Your goodness You provided for the poor, O God.","The Lord gives the command; / The women who bear the glad tidings are a great host.","The kings of the armies flee. / They flee! / And she who abides at home / Divides the spoil.","Though you lie among the sheepfolds, / There are dove wings covered with silver, / And its pinions, with greenish-yellow gold.","When the Almighty scattered / The kings in the land, / It snowed on Zalmon.","O mighty mountain, O mountain of Bashan, / O many-peaked mountain, O mountain of Bashan:","Why do you look with envy, O many-peaked mountains, / At the mountain on which God desires to dwell? / Indeed Jehovah will dwell there forever.","The chariots of God are twenty thousand, / Thousands upon thousands; / The Lord is among them, / As at Sinai, in the sanctuary.","You have ascended on high; You have led captive those taken captive; / You have received gifts among men, / Even the rebellious ones also, / That Jehovah God may dwell among them.","Blessed be the Lord, who day by day loads us with good; / God is our salvation. Selah","God is to us / A God of deliverance, / And with Jehovah the Lord / Are the goings forth even from death.","Indeed God will smash / The head of His enemies, / The hairy crown / Of him who goes about in his guiltiness.","The Lord said, I will bring them again from Bashan; / I will bring them again from the depths of the sea,","That you may bathe your foot in blood, / That the tongue of your dogs may have their portion from the enemies.","They have seen Your goings, O God, / The goings of my God, my King, in the sanctuary:","Singers go before; players after; / In the midst of virgins sounding the tambourines.","Bless God in the congregations, / Even Jehovah, O you who are of the fountain of Israel.","There are little Benjamin, who rules them, / And the princes of Judah in their company, / The princes of Zebulun, the princes of Naphtali.","Your God has commanded your strength; / Strengthen, O God, that which You have done for us.","Because of Your temple at Jerusalem, / Kings will bring a gift to You.","Rebuke the animals of the reeds, / The herd of the bulls among the calves of the peoples, / Trampling on those who lust after silver; / Scatter the peoples who take delight in war.","Nobles will come out of Egypt; / Cush will quickly stretch out its hands to God.","O kingdoms of the earth, / Sing to God, / Sing psalms to the Lord, Selah","To Him who rides upon the ancient heaven of heavens. / Behold, He utters His voice, a mighty voice.","Ascribe strength to God; / His excellence is over Israel, / And His strength is in the skies.","You are awesome, O God, from Your sanctuaries. / The God of Israel, He gives strength and power to the people. / Blessed be God!"],["Save me, O God; for the waters / Threaten my life.","I sink in deep mire, / And there is no place to stand; / I have come to the depths of water, / And the flood flows over me.","I am weary of my crying; / My throat is parched; / My eyes fail / While I wait for my God.","More numerous than the hairs of my head / Are those who hate me without cause; / Mighty are those who would destroy me, / Those who are wrongly my enemies. / What I did not steal, / I must then restore.","O God, You know my foolishness, / And my sins of guilt are not hidden from You.","Do not let those who wait on You be put to shame because of me, / O Lord Jehovah of hosts; / Do not let those who seek You be humiliated because of me, / O God of Israel.","Because for Your sake I have borne reproach; / Humiliation has covered my face.","I have become a stranger to my brothers, / And a foreigner to my mother’s children.","For the zeal of Your house has devoured me, / And the reproaches of those who reproach You have fallen on me.","When I wept, when my soul was in fasting, / That became a reproach to me.","When I made sackcloth my clothing, / I became a proverb to them.","Those who sit in the gate talk about me, / And I am the mocking song of those who drink liquor.","But as for me, my prayer is to You, / O Jehovah, in an acceptable time; / O God, in the abundance of Your lovingkindness answer me, / In the faithfulness of Your salvation.","Deliver me out of the mire, and let me not sink; / May I be delivered from those who hate me, / And out of the depths of water.","Do not let the flood of water flow over me, / Nor let the deep swallow me, / Nor let the pit close its mouth over me.","Answer me, O Jehovah; for Your lovingkindness is good; / According to the abundance of Your compassions turn to me.","And do not hide Your face from Your servant, / For I am in distress; hurry and answer me.","Draw near to my soul; redeem it; / Ransom me because of my enemies.","You know my reproach / And my shame and my humiliation; / All my adversaries are before You.","Reproach has broken my heart, / And I am sick; / I looked for pity, but there was none; / And for comforters, but I found none.","But they gave me gall for my food, / And for my thirst they gave me vinegar to drink.","May their table become a snare before them / And a trap when they are at peace.","May their eyes be darkened so that they cannot see; / And make their loins shake continually.","Pour out Your indignation upon them; / And may the burning fierceness of Your anger overtake them.","May their camp be desolate; / May there be no one to dwell in their tents.","For they persecute him whom You have stricken, / And they recount the pain of those whom You have wounded.","Add iniquity to their iniquity, / And do not let them come into Your righteousness.","May they be blotted out of the book of life, / And may they not be written with the righteous.","But I am poor and pained; / May Your salvation, O God, set me on high.","I will praise the name of God with a song / And will magnify Him with thanksgiving;","And it will be better to Jehovah than an ox / Or a bull with horns and hooves.","The meek have seen it; they rejoice. / You who seek God, let your heart revive.","For Jehovah listens to the needy, / And He does not despise His prisoners.","Let the heavens and the earth praise Him, / The seas and everything that moves in them.","For God will save Zion / And build the cities of Judah; / And they will abide there and possess it.","And the seed of His servants will inherit it, / And those who love His name will dwell in it."],["O God, hasten to deliver me; / O Jehovah, hasten to help me.","May those who seek my life / Be put to shame and confounded; / May those who take delight in my misfortune / Be turned back and humiliated;","May those who say, Aha! Aha! / Turn away because of their shame;","May all those who seek You / Be glad and rejoice in You; / And may those who love Your salvation / Say continually, / May God be magnified!","But I am poor and needy; / O God, hasten to me. / You are my help and my Deliverer; / O Jehovah, do not delay."],["In You, O Jehovah, do I take refuge; / Never let me be put to shame.","In Your righteousness deliver me and rescue me; / Incline Your ear to me and save me.","Be to me a rock of habitation for me to come to continually. / You have given command to save me, / For You are my rock and my fortress.","My God, rescue me from the hand of the wicked, / From the hand of the unjust and cruel;","For You are my hope, O Lord Jehovah, / My trust from my youth.","On You I have been sustained since birth; / It was You who took me from my mother’s womb; / My praise is continually of You.","I am like a wonder to many, / But You are my strong refuge.","My mouth is filled with Your praise, / With Your glory, all day long.","Do not cast me off in the time of old age; / When my strength fails, do not forsake me.","For my enemies speak concerning me, / And those who watch for my soul take counsel together,","Saying, God has forsaken him; / Pursue and lay hold of him, for there is no one to deliver him.","O God, do not be far away from me; / My God, hasten to help me.","May those who are the adversaries to my soul / Be put to shame and consumed; / May those who seek my misfortune / Wrap themselves in reproach and humiliation.","But I will hope continually / And will add yet more to all Your praise.","My mouth will recount Your righteousness, / Your salvation, all day long; / For I do not know its full numbers.","I will come with the proof of the mighty acts of the Lord Jehovah; / I will remind men of Your righteousness, Yours alone.","O God, You have taught me from my youth; / And until now I have declared Your wondrous deeds.","So even into my old age and grayheadedness, / O God, do not forsake me, / Until I have declared Your strength / Unto the next generation, / Your might unto everyone who is to come.","And Your righteousness, O God, is so high, / You who have done great things. / O God, who is like You?","You who have shown me / Many great troubles / Will revive me again / And bring me up again / From the depths of the earth.","You will increase my greatness / And will turn and comfort me.","I will also praise You with the harp, / I will praise Your faithfulness, my God; / I will sing psalms to You with the lyre, / O Holy One of Israel.","My lips will give a ringing shout / When I sing psalms to You, / And my soul, which You have redeemed.","My tongue also will declare / Your righteousness all day long; / For they are put to shame, for they are confounded, / They who seek my misfortune."],["O God, give Your judgments to the king, / And Your righteousness to the son of the king.","He will judge Your people in righteousness, / And Your poor with justice.","The mountains will bear peace to the people, / And the hills, in righteousness.","He will judge the poor of the people; / He will save the children of the needy / And crush the oppressor.","They will fear You as long as the sun endures / And as long as the moon endures / Throughout the generations.","He will drop like rain upon mown grass, / Like abundant showers dripping on the earth.","In His days the righteous will flourish, / And there will be an abundance of peace / Until the moon is no more.","And He will have dominion from sea to sea / And from the River unto the ends of the earth.","The desert dwellers will bow down before Him, / And His enemies will lick the dust.","The kings of Tarshish and of the coastlands / Will pay tribute; / The kings of Sheba and Seba / Will present gifts.","And all the kings will bow down before Him; / All the nations will serve Him.","For He will deliver the needy man when he cries, / And the poor man who has no one to help him.","He will have pity on the weak and needy, / And the souls of the needy He will save.","From oppression and violence / He will redeem their soul, / And their blood will be precious in His sight.","So He shall live and to Him shall be given / The gold of Sheba; / And prayer shall be made continually for Him; / He shall be blessed all the day long.","There will be an abundance of grain on the earth, / Even at the tops of the mountains. / Its fruit will wave like the forests of Lebanon, / And those of the city will blossom like the foliage of the earth.","His name will be forever; / As long as the sun endures, His name will spread; / And men will be blessed in Him; / All the nations will call Him blessed.","Blessed be Jehovah God, the God of Israel, / Who alone does wondrous deeds;","And blessed be His glorious name forever; / And may His glory fill the whole earth. / Amen and Amen.","The prayers of David the son of Jesse are ended."],["Surely God is good to Israel, / To those who are pure in heart.","But as for me, my feet were nearly turned aside; / My steps had almost slipped.","For I was envious of the arrogant, / When I saw the prosperity of the wicked.","For they have no pangs in their death, / And their body is well nourished.","They do not find themselves in the hardship of men, / Nor are they plagued like other men.","Therefore pride is a necklace for them; / Violence covers them like a garment.","Their eyes bulge out from fatness; / The imaginations of their heart overflow.","They mock and wickedly speak of oppression; / They speak loftily.","They set their mouth against the heavens, / And their tongue walks about on the earth.","Therefore His people return here, / And waters of abundance are drained by them;","And they say, How does God know? / And is there knowledge with the Most High?","Behold, these are the wicked; / And always at ease, they heap up riches.","Surely I have purified my heart in vain, / And I have washed my hands in innocence.","For I have been plagued all day long / And chastened every morning.","If I had said, I will speak thus; / Behold, I would have betrayed the generation of Your children.","When I considered this in order to understand it, / It was a troublesome task in my sight,","Until I went into the sanctuary of God; / Then I perceived their end.","Surely You set them in slippery places; / You cast them down into ruins.","How they are made desolate in a moment! / They are utterly consumed by terrors.","Like a dream, when one awakes, You, O Lord, / Upon arising, will despise their image.","When my heart was embittered, / And inwardly I was pricked;","I was brutish and knew nothing; / I was like a beast before You.","Nevertheless I am continually with You; / You have taken hold of my right hand.","You will guide me with Your counsel, / And afterward You will receive me in glory.","Whom do I have in heaven but You? / And besides You there is nothing I desire on earth.","My flesh and my heart fail, / But God is the rock of my heart and my portion forever.","For behold, those who are far from You will perish; / You destroy all who go about as harlots away from You.","But as for me, drawing near to God is good for me; / I have made the Lord Jehovah my refuge, / That I may declare all Your works."],["Why, O God, have You cast us off forever? / Why does Your anger smoke against the sheep of Your pasture?","Remember Your assembly, which You have purchased of old, / Which You have redeemed as the tribe of Your inheritance, / And Mount Zion, where You dwell.","Lift up Your steps unto the perpetual ruins; / The enemy has damaged everything in the sanctuary.","Your adversaries have roared in the midst of Your assembly place; / They have set up their symbols as signs.","It looked like when men bring up axes / On the thicket of the trees.","And now they have struck down with hatchet and hammer / Its carved work altogether.","They have set fire to Your sanctuary; / They have defiled the dwelling place of Your name to the ground.","They said in their heart, Let us oppress them completely. / They have burned down all God’s assembly places in the land.","We do not see our signs; there is no longer a prophet, / Nor is there anyone among us who knows how long.","How long, O God, will the adversary reproach? / Will the enemy despise Your name forever?","Why do You withdraw Your hand, even Your right hand? / Bring it forth from the midst of Your bosom; destroy them.","But God is my King of old, / Accomplishing salvation in the midst of the earth.","You divided the sea by Your strength; / You broke the heads of the sea serpents on the waters.","You crushed the heads of the leviathan; / You gave him as food to the creatures of the desert.","You broke open the fountain and the torrent; / You dried up the ever-flowing streams.","The day is Yours; the night also is Yours; / You prepared the moon and the sun.","You established all the borders of the earth: / You formed the summer and the winter.","Remember this: The enemy has reproached Jehovah, / And a foolish people has despised Your name.","Do not give the soul of Your turtledove to the wild beast; / Do not forget the life of Your poor forever.","Regard the covenant, / For the dark places of the earth are full of the habitations of violence.","Do not let him who is oppressed return ashamed. / May the poor and needy praise Your name.","Arise, O God; contend for Your own cause; / Remember how the foolish man reproaches You all day long.","Do not forget the voice of Your adversaries; / The roar of those who rise up against You goes up continually."],["We give thanks to You, O God; we give thanks, / For Your name is near; men tell of Your wondrous deeds.","When I choose the appointed time, / It is I who judge with equity.","The earth and all who dwell in it melt; / I have established its pillars. Selah","I said to the boastful, Do not boast; / And to the wicked, Do not lift up the horn.","Do not lift your horn on high; / Do not speak arrogantly with a haughty neck.","For neither from the east nor from the west, / And neither from the south, does exaltation come;","For God is the Judge: / He puts this one down and exalts that one.","For there is a cup in the hand of Jehovah, / And the wine foams; it is full of mixture, / And He pours from it; indeed its dregs will all the wicked of the earth / Drain off and drink up.","But as for me, I will declare forever, / I will sing psalms to the God of Jacob.","And all the horns of the wicked will I cut off, / But the horns of the righteous man will be exalted."],["God is known in Judah; / His name is great in Israel.","And in Salem is His tabernacle, / And His dwelling place, in Zion.","There He broke the flashing arrows of the bow, / The shield and the sword and the battle. Selah","More glorious are You, / More excellent than the mountains of prey.","The stouthearted are despoiled; / They slept their sleep, / And none of the men of strength / Have found their hands.","At Your rebuke, O God of Jacob, / Both chariot and horse fall into deep sleep.","You, indeed You, are to be feared; / And who may stand before You once You are angry?","You caused judgment to be heard from the heavens; / The earth feared and was still,","When God rose for judgment, / To save all the meek of the earth. Selah","For the wrath of man will praise You; / You will gird Yourself with the remainder of wrath.","Make vows and pay them to Jehovah your God; / Let all who are around Him bring gifts to Him who is to be feared.","He will cut off the spirit of the princes; / He is terrible to the kings of the earth."],["My voice calls out to God, and I will cry out; / My voice calls out to God, and He will give ear to me.","In the day of my distress I sought the Lord; / My hand was stretched out in the night, and it did not drop. / My soul refused to be comforted.","I remember God, and I moan; / I complain, and my spirit faints. Selah","You hold open my eyelids; / I am disturbed and cannot speak.","I consider the days of old, / The years of ancient times;","I remember my song in the night; / I muse with my own heart, and my spirit carefully searches.","Will the Lord cast us off forever, / And will He never be favorable to us again?","Has His lovingkindness ceased forever? / Has the promise come to an end for all generations?","Has God forgotten to be gracious? / Or has He in anger shut up His compassions? Selah","Then I said, This is my infirmity; / But I recall the years of the right hand of the Most High.","I will bring to remembrance the deeds of Jehovah, / For I will remember Your wonders from of old.","And I will meditate on all that You have done / And muse on Your doings.","O God, Your way is in the sanctuary; / Who is so great a god as God?","You are the God who does wonders; / You have made known Your strength among the peoples.","You redeemed Your people with Your arm, / The sons of Jacob and Joseph. Selah","The waters saw You, O God; / The waters saw You; they were afraid; / Indeed the depths trembled.","The clouds poured forth water; / The skies sent forth a sound; / Indeed Your arrows went here and there.","The sound of Your thunder was in the whirlwind; / Lightning illuminated the world; / The earth trembled and quaked.","Your way was in the sea, / And Your paths in the great waters; / And Your footsteps were not known.","You led Your people like a flock / By the hand of Moses and Aaron."],["Give ear, O my people, to my instruction; / Incline your ears to the words of my mouth.","I will open my mouth in a parable; / I will utter riddles from of old,","Which we have heard and known, / And our fathers have related to us.","We will not hide them from their children, / But will relate to the generation to come / The praises of Jehovah and His strength / And His wondrous deeds that He has done.","Indeed He has established a testimony in Jacob / And appointed a law in Israel, / Which He commanded our fathers / That they should make them known to their children;","That the generation to come, / The children to be born, may know them, / Who should arise and relate them to their children;","That they might set their hope in God, / And not forget the deeds of God, / But observe His commandments;","That they might not be like their fathers, / A stubborn and rebellious generation, / A generation that did not set their heart right, / And whose spirit was not faithful to God.","The children of Ephraim, armed archers with bows, / Turned back in the day of battle.","They did not keep the covenant of God, / And they refused to walk in His law.","And they forgot His doings / And His wondrous deeds that He had shown them.","He did something wonderful in the sight of their fathers / In the land of Egypt, in the field of Zoan.","He divided the sea and caused them to pass through, / And He made the water stand as a heap.","And He led them with the cloud by day / And all the night with a light of fire.","He split rocks in the wilderness / And gave them abundant drink, as from the depths.","He also brought forth streams from the rock / And made water run down like rivers.","Yet they still continued to sin against Him, / To rebel against the Most High in the desert.","And they put God to the test in their heart, / By asking for food according to their desire.","They also spoke against God; / They said, Can God prepare a table in the wilderness?","Behold, He struck the rock, / And water gushed out, / And streams overflowed; / Can He also give us bread, / Or provide meat for His people?","Therefore Jehovah heard and was angry. / And a fire was kindled against Jacob, / And also anger went up against Israel;","Because they did not believe in God, / And they did not trust in His salvation.","Yet He commanded the skies above / And opened the doors of heaven;","And He rained down upon them manna to eat / And gave them the food of heaven.","Man ate the bread of the mighty; / He sent them full provision.","He made the east wind blow in the heavens / And guided the south wind by His strength.","And He rained upon them meat like dust, / And winged birds like the sand of the seas.","And He made it fall in the midst of their camp, / Around their habitations.","So they ate and were well filled; / Indeed what they desired He brought to them.","They were not estranged from what they desired; / Their food was still in their mouths","When the anger of God went up against them / And slew some of their fattest ones / And struck down the choice men of Israel.","In spite of all this they still sinned / And did not believe in His wondrous deeds.","Therefore He consumed their days with vanity, / And their years with terror.","When He slew them, they inquired after Him, / And they returned and diligently sought God.","And they remembered that God was their rock, / And the Most High God, their Redeemer.","But they flattered Him with their mouth / And lied to Him with their tongue.","For their heart was not steadfast toward Him, / Nor were they faithful to His covenant.","But He, being merciful, forgave their iniquity / And did not destroy them; / Indeed He turned back His anger many times / And did not stir up all His wrath.","And He remembered that they were flesh, / A wind that goes away and does not return.","How often they rebelled against Him in the wilderness / And grieved Him in the desert!","And they repeatedly put God to the test / And provoked the Holy One of Israel.","They did not remember His hand, / The day when He ransomed them from the adversary;","When He set His signs in Egypt / And His wonders in the field of Zoan;","And He turned their rivers into blood, / As well as their streams, so that they could not drink.","He sent among them a swarm of flies, which devoured them; / And frogs, which destroyed them.","And He gave their increase to the consuming locust, / And their labor to the swarming locust.","He killed their vines with hail, / And their sycamores with ice stones.","He gave over their cattle also to the hail / And their herds to the lightning bolts.","He sent among them the burning fierceness of His anger, / Overflowing wrath and indignation and trouble, / A mission of angels of evils.","He leveled a path for His anger; / He did not spare their soul from death, / But gave their life over to the pestilence.","And He struck all the firstborn in Egypt, / The firstfruits of their vigor in the tents of Ham.","But He set forth His people like sheep / And led them like a flock in the wilderness.","And He led them to safety, so that they did not fear; / But the sea covered their enemies.","And He brought them forth to His holy border, / The mountain, which His right hand had acquired.","And He drove out the nations before them / And allotted them as an inheritance by line, / And He made the tribes of Israel dwell there in their tents.","Yet they put Him to the test and rebelled against God the Most High, / And did not keep His testimonies.","And they turned back and dealt treacherously, as their fathers had done; / They turned aside like a deceitful bow.","Indeed they provoked Him to anger with their high places / And made Him jealous with their graven images.","God heard, and He was angered; / And He greatly abhorred Israel.","Thus He forsook the tabernacle in Shiloh, / The tent in which He dwelt among men;","And He gave over His Ark into captivity, / And His glory into the hand of the adversary.","He also delivered His people to the sword / And was angry with His inheritance.","Fire devoured their young men, / And their virgins had no marriage song.","Their priests fell by the sword, / And their widows did not lament.","Then the Lord awoke as if from sleep, / Like a mighty man who shouts because of wine.","And He struck His adversaries and sent them back; / He put an everlasting reproach upon them.","And He rejected the tent of Joseph, / And the tribe of Ephraim He did not choose.","Rather He chose the tribe of Judah, / Mount Zion, which He loved.","And He built His sanctuary like the heights, / Like the earth that He has founded forever.","Moreover He chose David His servant / And took him from the sheepfolds;","From following after the ewes He brought him / To shepherd Jacob His people / And Israel His inheritance.","And he shepherded them according to the integrity of his heart, / And guided them by the skillfulness of his hands."],["O God, the nations have come into Your inheritance; / They have defiled Your holy temple; / They have turned Jerusalem into heaps.","They have given the dead bodies of Your servants / As food for the birds of heaven, / The flesh of Your saints to the animals of the earth.","They have poured out their blood like water around Jerusalem, / And there was no one to bury them.","We have become a reproach to our neighbors, / A mocking and a derision to those around us.","How long, O Jehovah? Will You be angry forever? / Will Your jealousy burn like fire?","Pour out Your wrath upon the nations / Who do not know You, / And upon the kingdoms / Who do not call upon Your name.","For they have devoured Jacob / And have desolated his habitation.","Do not remember against us the iniquities of our forefathers; / May Your compassions quickly meet us, / For we have been brought very low.","Help us, O God of our salvation, / For the glory of Your name; / And deliver us and expiate our sins, / For Your name’s sake.","Why should the nations say, / Where is their God? / May the avenging of the blood of Your servants, which has been poured out, / Be known among the nations in our sight.","May the sighing of the prisoner come before You. / According to the greatness of Your power preserve those appointed to die,","And render to our neighbors sevenfold into their bosom / Their reproach, with which they have reproached You, O Lord.","And we, Your people and the sheep of Your pasture, / Will give You thanks forever; / From generation to generation we will tell out Your praise."],["O Shepherd of Israel, give ear, / You who lead Joseph like a flock; / You who are enthroned between the cherubim, shine forth.","Before Ephraim and Benjamin and Manasseh / Stir up Your might, / And come to save us.","O God, restore us; / And cause Your face to shine, and we will be saved.","O Jehovah God of hosts, / How long will You fume / Against the prayer of Your people?","You have fed them with the bread of tears / And have made them drink tears in large measure.","You have made us a cause of strife to our neighbors, / And our enemies deride us among themselves.","O God of hosts, restore us; / And cause Your face to shine, and we will be saved.","You brought a vine out of Egypt; / You drove out nations and planted it;","You cleared the ground before it, / And it took deep root and filled the land.","The mountains were covered with its shadow, / And its boughs were like the cedars of God.","It put forth its branches unto the sea, / And its shoots unto the River.","Why have You broken down its hedges, / So that all who pass by on the way pluck it?","The boar from the forest ravages it, / And that which moves through the field feeds on it.","O God of hosts, turn, we beseech You; / Look down from heaven and see, / And visit this vine,","Even the stock which Your right hand has planted / And the son whom You have strengthened for Yourself.","It is burned with fire; it is cut down; / They perish at the rebuke of Your countenance.","Let Your hand be upon the man of Your right hand, / Upon the son of man whom You have strengthened for Yourself;","Then we will not turn back from You. / Revive us, and we will call upon Your name.","O Jehovah God of hosts, restore us; / Cause Your face to shine, and we will be saved."],["Sing for joy to God our strength; / Make a joyful noise to the God of Jacob.","Lift up a song and sound the tambourine, / The pleasant lyre with the harp.","Blow the trumpet at the new moon, / At the full moon, on our feast day.","For that is a statute of Israel, / An ordinance of the God of Jacob.","He appointed it as a testimony in Joseph / When He went out over the land of Egypt. / I heard a language that I did not know:","I turned your shoulder from the burden; / Your hands were freed from the basket.","You called in trouble, and I delivered you; / I answered you from the secret place of thunder; / I proved you at the waters of Meribah. Selah","Hear, O My people, and I will testify against you: / O Israel, if you would listen to Me!","There shall be no strange god among you, / Neither shall you worship any foreign god.","I am Jehovah your God, / Who brought you up out of the land of Egypt; / Open your mouth wide, and I will fill it.","But My people did not listen to My voice, / And Israel would not consent to Me.","So I gave them over to the stubbornness of their heart: / They walked after their own counsels.","Oh that My people had listened to Me, / That Israel had walked in My ways!","I would have soon subdued their enemies / And turned My hand against their adversaries.","Those who hate Jehovah would have come cringing to Him, / And their time would be forever.","And He would have fed them with the finest of wheat; / Indeed with honey from the rock I would have satisfied you."],["God stands in the congregation of God; / He judges in the midst of the gods.","How long will you judge unjustly / And respect the persons of the wicked? Selah","Judge the poor and the orphan; / Execute justice for the afflicted and the destitute;","Rescue the poor and the needy; / Deliver them from the hand of the wicked.","You do not know, nor do you understand; / You go about in darkness; / All the foundations of the earth are shaken.","I said, You are gods, / And all of you are sons of the Most High.","Nevertheless you will die like men / And fall like one of the princes.","Arise, O God; judge the earth; / For You will inherit all the nations."],["O God, do not keep silent; / Do not be quiet, and do not be still, O God.","For, behold, Your enemies are in tumult, / And those who hate You lift up their heads.","They devise crafty counsel against Your people, / And conspire against Your hidden ones.","They have said, Come and let us destroy them from being a nation, / That the name of Israel may no longer be remembered.","For they have conspired together with one heart; / It is against You that they have made an alliance:","The tents of Edom and the Ishmaelites, / Moab and the Hagarites,","Gebal and Ammon and Amalek, / Philistia along with the inhabitants of Tyre;","Assyria is also joined with them; / They have been a help to the children of Lot. Selah","Do with them as with Midian, / As with Sisera and Jabin, at the brook Kishon:","They were destroyed at Endor; / They became dung for the earth.","Make their nobles like Oreb and Zeeb, / And all their princes like Zebah and Zalmunna,","Who said, Let us possess for ourselves / The habitations of God.","O my God, make them like a tumbleweed, / Like stubble before the wind.","Like fire that burns a forest / And like a flame that sets mountains on fire,","So pursue them with Your tempest, / And terrify them with Your storm.","Fill their faces with shame, / That they may seek Your name, O Jehovah.","May they be ashamed and dismayed forever, / And may they be confounded and perish;","That they may know that You alone, whose name is Jehovah, / Are the Most High over all the earth."],["How lovely are Your tabernacles, / O Jehovah of hosts!","My soul longs, indeed even faints, / For the courts of Jehovah; / My heart and my flesh cry out / To the living God.","At Your two altars even the sparrow has found a home; / And the swallow, a nest for herself, / Where she may lay her young, / O Jehovah of hosts, my King and my God.","Blessed are those who dwell in Your house; / They will yet be praising You. Selah","Blessed is the man whose strength is in You, / In whose heart are the highways to Zion.","Passing through the valley of Baca, / They make it a spring; / Indeed the early rain covers it with blessings.","They go from strength to strength; / Each appears before God in Zion.","O Jehovah God of hosts, hear my prayer; / Give ear, O God of Jacob. Selah","Behold our shield, O God; / And look upon the face of Your anointed.","For a day in Your courts is better than a thousand; / I would rather stand at the threshold of the house of my God / Than dwell in the tents of the wicked.","For Jehovah God is a sun and a shield; / Jehovah gives grace and glory; / He does not withhold anything good / From those who walk uprightly.","O Jehovah of hosts, blessed is the man / Who trusts in You."],["You have been pleased, O Jehovah, with Your land; / You have turned the captivity of Jacob.","You have forgiven the iniquity of Your people; / You have covered all their sin. Selah","You have taken away all Your wrath; / You have turned from the fierceness of Your anger.","Restore us, O God of our salvation, / And cause Your indignation toward us to cease.","Will You be angry with us forever? / Will You extend Your anger from generation to generation?","Will You not again revive us, / That Your people may rejoice in You?","Show us, O Jehovah, Your lovingkindness, / And grant us Your salvation.","I will hear what God Jehovah will speak, / For He will speak peace / To His people and to His faithful ones; / But let them not turn again unto folly.","Surely His salvation is near to those who fear Him, / That glory may dwell in our land.","Lovingkindness and truth have met together; / Righteousness and peace have kissed each other.","Truth has sprung forth from the earth, / And righteousness has looked down from heaven.","Indeed Jehovah will give what is good, / And our land will give its increase.","Righteousness will go before Him / And make His footsteps a way to walk in."],["Incline Your ear, O Jehovah; answer me; / For I am poor and needy.","Keep my soul; for I am faithful; / Save Your servant who trusts in You, O You who are my God.","Be gracious to me, O Lord; / For to You do I call out all day long.","Cause the soul of Your servant to rejoice, / For unto You, O Lord, do I lift up my soul.","For You, O Lord, are good and ready to forgive / And abundant in lovingkindness to all who call upon You.","Give ear, O Jehovah, to my prayer, / And give heed to the voice of my supplications.","In the day of my distress I call upon You, / For You answer me.","There is none like You among the gods, O Lord; / Nor are there any works like Yours.","All the nations which You have made will come / And worship before You, O Lord; / And they will glorify Your name.","For You are great, and You do wondrous deeds; / You alone are God.","Teach me, O Jehovah, Your way; / I will walk in Your truth. / Make my heart single in fearing Your name.","I will praise You, O Lord my God, with all my heart; / And I will glorify Your name forever.","For Your lovingkindness is great toward me, / And You have delivered my soul from the lowest Sheol.","O God, the proud have risen up against me, / And a company of violent men seek my life; / And they do not set You before them.","But You, O Lord, are a compassionate and gracious God, / Long-suffering and abundant in lovingkindness and truth.","Turn to me and be gracious to me; / Give Your strength to Your servant, / And save the son of Your female servant.","Show me a token of goodness, / That those who hate me may see it and be ashamed; / For You, O Jehovah, have helped me and comforted me."],["His foundation is in the holy mountains.","Jehovah loves the gates of Zion / More than all the dwellings of Jacob.","Glorious things are spoken of you, / O city of God. Selah","I will make mention of Rahab and Babylon as those who know Me; / Behold, Philistia and Tyre along with Cush: / This one was born there, they say.","But of Zion it will be said, / This one and that one were born in her, / And the Most High Himself will establish her.","Jehovah will count / When He records the peoples: / This One was born there. Selah","Then singing as well as dancing, they will say, / All my springs are in you."],["O Jehovah, the God of my salvation, / I have cried out by day and in the night before You.","May my prayer come before You; / Incline Your ear to my cry.","For my soul is full of troubles, / And my life draws near to Sheol.","I am accounted among those who go down into the pit; / I am like a man without any help,","Abandoned among the dead, / Like the slain that lie in the grave, / Whom You remember no more, / And they are cut off from Your hand.","You have put me in the lowest pit, / In the dark places, in the depths.","Your wrath lies heavily upon me, / And You have afflicted me with all Your waves. Selah","You have put my acquaintances far from me; / You have made me an abomination to them. / I am shut in and cannot go out.","My eye wastes away at the affliction; / I have called out to You, O Jehovah, every day; / I have spread out my hands to You.","Will You perform wonders for the dead? / Will the deceased rise up and praise You? Selah","Will Your lovingkindness be declared in the grave, / Or Your faithfulness in Abaddon?","Will Your wonders be made known in the darkness, / Or Your righteousness in the land of forgetfulness?","But I, O Jehovah, have cried out to You; / And in the morning my prayer comes before You.","Why, O Jehovah, have You rejected my soul? / Why do You hide Your face from me?","I have been afflicted and about to die since my youth; / I bear Your terrors; I am overwhelmed.","Your fierce wrath has gone over me; / Your terrors have cut me off.","They surrounded me like water all day long; / They altogether encompassed me.","You have put far from me / Lover and friend; / My acquaintances are in darkness."],["I will sing of the lovingkindness of Jehovah forever; / From generation to generation I will make known Your faithfulness with my mouth.","For I have said, Lovingkindness will be built up forever; / In the heavens themselves You will establish Your faithfulness.","I have made a covenant with My chosen one; / I have sworn to David My servant:","I will establish your seed forever, / And I will build up your throne from generation to generation. Selah","And the heavens will praise Your wonders, O Jehovah, / Indeed Your faithfulness in the congregation of the holy ones.","For who in the skies can be compared to Jehovah? / Who among the sons of the mighty is like Jehovah,","Like God, greatly feared in the council of the holy ones / And awesome beyond all around Him?","O Jehovah God of hosts, who is like You, the mighty Jah? / Your faithfulness also surrounds You.","You rule the swelling of the sea: / When its waves rise up, You still them.","You crushed Rahab like one slain; / You scattered Your enemies with the arm of Your strength.","The heavens are Yours; the earth also is Yours; / The world and its fullness You have founded.","You created the north and the south; / Tabor and Hermon shout for joy at Your name.","You have an arm with might; / Your hand is strong; Your right hand is high.","Righteousness and justice are the foundation of Your throne; / Lovingkindness and truth go before Your face.","Blessed are the people who know the joyful shout; / They walk, O Jehovah, in the light of Your countenance.","In Your name they exult all day long, / And in Your righteousness they are exalted.","For You are the glory of their strength, / And in Your favor our horn is exalted.","For our shield belongs to Jehovah, / And our king, to the Holy One of Israel.","Then You spoke in vision / Of Your Holy One, and You said, / I have given help to One who is mighty; / I have exalted One chosen from My people.","I have found David My Servant; / With My holy oil I have anointed Him,","With whom My hand will be established; / My arm will also strengthen Him.","The enemy will not exact anything from Him, / Nor will the son of wickedness afflict Him.","And I will crush His adversaries before Him, / And I will strike those who hate Him.","And My faithfulness and My lovingkindness will be with Him, / And in My name His horn will be exalted.","And I will set His hand on the sea / And His right hand on the rivers.","He will call upon Me, saying, You are My Father, / My God and the rock of My salvation.","I will also make Him the Firstborn, / The highest of the kings of the earth.","I will keep My lovingkindness for Him forever, / And My covenant will stand firm with Him.","And I will establish His seed forever, / And His throne as the days of heaven.","If His children forsake My law / And do not walk in My ordinances,","If they profane My statutes / And do not keep My commandments,","I will punish their transgression with a rod / And their iniquity with stripes.","But My lovingkindness I will not utterly take away from Him, / Nor will I be false to My own faithfulness.","I will not profane My covenant, / Nor will I change what has gone forth from My lips.","Once I have sworn by My holiness; / I will not lie to David.","His seed shall endure forever, / And His throne, like the sun before Me;","It shall be established forever like the moon; / And the witness in the skies is firm. Selah","But You have cast off and rejected; / You have been angry with Your anointed.","You have abhorred the covenant of Your servant; / You have profaned his crown by casting it to the ground.","You have broken down all his walls; / You have brought his strongholds to ruin.","All who pass by on the way plunder him; / He has become a reproach to his neighbors.","You have exalted the right hand of his adversaries; / You have caused all his enemies to rejoice.","Indeed You have turned back the edge of his sword / And have not made him stand in the battle.","You have made his brightness cease / And have cast down his throne to the ground.","You have shortened the days of his youth; / You have covered him with shame. Selah","How long, O Jehovah? Will You hide Yourself forever? / How long will Your wrath burn like fire?","Remember how short my time is — / For what vanity You have created all the sons of men!","What man will live and not see death? / Will he deliver his soul from the power of Sheol? Selah","Where are Your former acts of lovingkindness, O Lord, / Which You swore to David in Your faithfulness?","Remember, O Lord, the reproach of Your servants, / How I bear in my bosom the reproach of all the mighty peoples,","With which Your enemies have reproached, O Jehovah, / With which they have reproached the footsteps of Your anointed.","Blessed be Jehovah forever. / Amen and Amen."],["O Lord, You have been our dwelling place / In all generations.","Before the mountains were brought forth, / And before You gave birth to the earth and the world, / Indeed from eternity to eternity, You are God.","You return man to dust / And say, Return, you sons of men.","For a thousand years in Your sight / Are like yesterday when it passes by / And like a watch in the night.","You sweep them away as with a rain flood; they are as in a sleep: / In the morning they are like grass that comes up anew.","In the morning it flourishes and comes up anew; / In the evening it is cut down, and it dries up.","For we have been consumed by Your anger, / And by Your wrath we have been troubled.","You have set our iniquities before You, / Our secret sins in the light of Your countenance.","For all our days have passed away in Your overflowing wrath; / We bring our years to an end like a sigh.","The days of our years are seventy years, / Or, if because of strength, eighty years; / But their pride is labor and sorrow, / For it is soon gone, and we fly away.","Who knows the power of Your anger, / And Your overflowing wrath according to the fear that is due You?","Teach us then to number our days / That we may gain a heart of wisdom.","Return, O Jehovah! How long? / And repent concerning Your servants.","Satisfy us in the morning with Your lovingkindness / That we may give a ringing shout and rejoice all our days.","Cause us to rejoice according to the days that You have afflicted us, / According to the years that we have seen evil.","Let Your work appear to Your servants, / And Your splendor, to their children.","And let the favor of the Lord our God be upon us, / And establish the work of our hands upon us; / Indeed the work of our hands, establish it."],["He who dwells in the secret place of the Most High / Will abide in the shadow of the Almighty.","I say of Jehovah, / My refuge and My fortress, / My God in whom I trust!","For He will deliver You / From the snare of the fowler, / From the deadly pestilence.","With His pinions He will cover You, / And under His wings You will take refuge; / His truth is a shield and a buckler.","You will not be afraid of the terror by night, / Or of the arrow that flies by day,","Or of the pestilence that walks in darkness, / Or of the destruction that lays waste at noon.","A thousand will fall at Your side, / And ten thousand at Your right hand; / But it will not come near to You.","You will only look on with Your eyes / And see the recompense of the wicked.","For You have made Jehovah, who is my refuge, / Even the Most High, Your habitation;","No evil will befall You, / Nor will any plague come near Your tent.","For He will give His angels charge concerning You / To keep You in all Your ways.","They will bear You up in their hands, / Lest You dash Your foot against a stone.","You will tread upon the lion and the cobra; / You will trample the young lion and the serpent.","Because He has set His love upon Me, I will rescue Him; / I will set Him on high, because He has known My name.","He will call upon Me, and I will answer Him. / I will be with Him in distress; / I will deliver Him and honor Him.","With an extension of His days I will satisfy Him, / And I will show Him My salvation."],["It is good to give thanks to Jehovah / And to sing psalms to Your name, O Most High;","To declare Your lovingkindness in the morning / And Your faithfulness in the nights,","Upon an instrument of ten strings and upon a harp, / Upon the higgaion of the lyre.","For You have made me rejoice, O Jehovah, because of what You have done; / Because of the works of Your hands I will shout for joy.","How great are Your works, O Jehovah! / So very deep are Your thoughts!","A senseless man does not know them, / Nor does a fool understand them.","When the wicked sprout like grass, / And all the workers of iniquity blossom, / It is so that they may be destroyed forever.","But You are on high forever, O Jehovah.","For behold, Your enemies, O Jehovah; / For behold, Your enemies will perish; / All the workers of iniquity will be scattered.","But You have exalted my horn like that of a wild ox; / I am anointed with fresh oil.","And my eye has seen its desire for my enemies; / My ears have heard their desire for the evildoers who rise up against me.","The righteous man will flourish like the palm tree; / He will grow like a cedar in Lebanon.","Planted in the house of Jehovah, / They will flourish in the courts of our God.","They will still bring forth fruit in old age; / They will be full of sap and green;","To declare that Jehovah is upright; / He is my rock, and there is no unrighteousness in Him."],["Jehovah reigns; He is clothed with majesty. / Jehovah is clothed, He has girded Himself, with strength. / Indeed the world has been established; it will not be moved.","Your throne is established from of old; / You are from eternity.","The floods have lifted up, O Jehovah; / The floods have lifted up their voice; / The floods lift up their roaring.","More than the voices of many waters, / Than the mighty breakers of the sea, / Jehovah on high is mighty!","Your testimonies are very sure; / Holiness befits Your house, / O Jehovah, forevermore."],["O God of vengeance, O Jehovah, / O God of vengeance, shine forth!","Lift Yourself up, O Judge of the earth; / Render the reward upon the proud.","How long, O Jehovah, will the wicked, / How long will the wicked exult?","They burst out; they speak arrogantly; / All the workers of iniquity boast.","They crush Your people, O Jehovah, / And afflict Your inheritance.","They slay the widow and the stranger, / And they murder orphans.","And they say, Jehovah does not see, / And the God of Jacob does not consider.","Consider, you senseless ones among the people; / And you foolish ones, when will you become wise?","He who planted the ear, does He not hear? / And He who formed the eye, does He not see?","He who disciplines the nations, / He who teaches man knowledge, does He not reprove?","Jehovah knows the thoughts of man, / That they are vanity.","Blessed is the man / Whom You discipline, O Jehovah, / And teach out of Your law;","That You may give him rest from the days of evil / Until the pit is dug for the wicked.","For Jehovah will not abandon His people, / Nor will He forsake His inheritance.","For judgment will return unto righteousness, / And all the upright in heart will follow it.","Who will rise up for me against the evildoers? / Who will stand up for me against the workers of iniquity?","Unless Jehovah had been my help, / My soul would have soon dwelt in silence.","When I said, My foot has slipped, / Your lovingkindness, O Jehovah, upheld me.","When my disquieting thoughts within me are many, / Your comfortings delight my soul.","Shall the seat of destruction be united with You, / Which devises trouble through its statutes?","They band together against the soul of the righteous man / And condemn innocent blood.","But Jehovah has been my high tower, / And my God the rock of my refuge;","And He will return their iniquity upon them / And destroy them in their own evil; / Jehovah our God will destroy them."],["Come, let us sing for joy to Jehovah; / Let us make a joyful noise to the rock of our salvation.","Let us come before His presence with thanksgiving; / Let us make a joyful noise to Him with psalms.","For Jehovah is a great God / And a great King above all gods.","In His hand are the depths of the earth; / The heights of the mountains are His also.","The sea is His, and He made it; / And His hands formed the dry land.","Come, let us worship and bow down; / Let us kneel before Jehovah our Maker.","For He is our God, / And we are the people of His pasture / And the flock of His hand. / Today, if you hear His voice,","Do not harden your heart as at Meribah, / As in the day of Massah in the wilderness,","When your fathers tested Me; / They tried Me, even though they had seen My work.","For forty years I loathed that generation, / And I said, They are a people who go astray in heart; / And they do not know My ways;","Therefore I swore in My anger: / They shall by no means enter into My rest!"],["Sing to Jehovah a new song; / Sing to Jehovah, all the earth.","Sing to Jehovah, bless His name; / Proclaim His salvation from day to day.","Declare His glory among the nations, / His wondrous deeds among all the peoples.","For Jehovah is great and much to be praised; / He is to be feared above all gods.","For all the gods of the peoples are idols, / But Jehovah made the heavens.","Majesty and splendor are before Him; / Strength and beauty are in His sanctuary.","Ascribe to Jehovah, O families of the peoples, / Ascribe to Jehovah glory and strength;","Ascribe to Jehovah the glory of His name; / Bring an offering, and come into His courts.","Worship Jehovah in holy splendor; / Tremble before Him, all the earth.","Say among the nations, Jehovah reigns; / Indeed the world has been established; it will not be moved; / He will judge the peoples with equity.","Let the heavens rejoice and the earth be glad; / Let the sea and its fullness roar.","Let the field and all that is in it exult; / Then all the trees of the forest will sing for joy","Before Jehovah, for He is coming; / For He is coming to judge the earth; / He will judge the world with righteousness, / And the peoples with His truth."],["Jehovah reigns! Let the earth be glad; / Let the many islands rejoice.","Clouds and deep darkness surround Him; / Righteousness and justice are the foundation of His throne.","A fire goes before Him / And burns up His adversaries all around.","His lightning illumines the world; / The earth sees and trembles.","The mountains melt like wax at the presence of Jehovah, / At the presence of the Lord of the whole earth.","The heavens declare His righteousness, / And all the peoples see His glory.","Let all who serve a graven image be ashamed, / Who make their boast in idols; / Worship Him, all you gods.","Zion hears and rejoices, / And the daughters of Judah are glad, / Because of Your judgments, O Jehovah.","For You, O Jehovah, are most high over all the earth; / You are exalted far above all gods.","O you who love Jehovah, hate evil! / He preserves the souls of His faithful ones; / He delivers them from the hand of the wicked.","Light is sown for the righteous man, / And rejoicing for the upright in heart.","Rejoice in Jehovah, O righteous ones; / And praise His holy memorial."],["Sing to Jehovah a new song, / For He has done wonderful things. / His right hand and His holy arm / Have accomplished salvation for Him.","Jehovah has made His salvation known; / In the sight of the nations / He has revealed His righteousness.","He remembered His lovingkindness and His faithfulness / Toward the house of Israel; / All the ends of the earth have seen / The salvation of our God.","Make a joyful noise to Jehovah, all the earth; / Break forth, and sing for joy, and sing psalms.","Sing psalms to Jehovah with the lyre, / With the lyre and the sound of melody.","With trumpets and the sound of the horn / Make a joyful noise before the King, Jehovah.","Let the sea and its fullness roar, / The world and those who inhabit it.","Let the rivers clap their hands; / Let the mountains sing for joy together","Before Jehovah, for He is coming / To judge the earth. / He will judge the world with righteousness / And the peoples with equity."],["Jehovah reigns; let the peoples tremble. / He is enthroned between the cherubim; let the earth shake.","Jehovah is great in Zion, / And He is exalted over all the peoples.","Let them praise Your great and awesome name — / It is holy — ","And the strength of the King, who loves justice. / You have established equity; / You have executed / Justice and righteousness in Jacob.","Exalt Jehovah our God, / And worship at His footstool; / Holy is He.","Moses and Aaron among His priests, / And Samuel among those who called on His name — / They called out to Jehovah, / And He answered them.","In the pillar of cloud He spoke to them; / They kept His testimonies and the statute that He gave them.","O Jehovah our God, You answered them; / You were a forgiving God to them, / Yet One avenging their deeds.","Exalt Jehovah our God, / And worship on His holy mountain; / For holy is Jehovah our God."],["Make a joyful noise to Jehovah, all the earth.","Serve Jehovah with rejoicing; / Come before His presence with joyful singing.","Know that it is Jehovah who is God; / It is He who has made us and not we ourselves. / We are His people and the sheep of His pasture.","Enter His gates with thanksgiving, / His courts with praise; / Give thanks to Him; bless His name.","For Jehovah is good; His lovingkindness is forever, / And His faithfulness is to all generations."],["I will sing of lovingkindness and justice; / To You, O Jehovah, I will sing psalms.","I will give careful heed to the perfect way. / When will You come to me? / I will walk in the perfectness of my heart / Within my house.","I will not set anything base / Before my eyes; / I hate what those who turn aside do; / It will not cling to me.","A perverse heart will depart from me; / No evil will I know.","He who secretly slanders his neighbor, / Him I will destroy; / He who is of a haughty look and a proud heart, / Him I will not tolerate.","My eyes are on the faithful of the land, / That they may abide with me; / He who walks in the perfect way, / He will minister to me.","He who practices deceit / Will not dwell within my house; / He who speaks lies will not be maintained / In my sight.","Morning by morning I will destroy / All the wicked of the land, / In order to cut off from the city of Jehovah / All the workers of iniquity."],["O Jehovah, hear my prayer; / And let my cry come unto You.","Do not hide Your face from me / On the day of my distress; / Incline Your ear to me; / On the day when I call out, answer me quickly.","For my days are consumed in smoke, / And my bones burn like a hearth.","My heart is stricken like grass and dried up; / Indeed I have even forgotten to eat my bread.","Because of the voice of my groaning / My bones cling to my flesh.","I am like a pelican of the wilderness; / I have become like an owl of the desolate places.","I watch, and I am like / A lone sparrow on a housetop.","All day long my enemies reproach me; / Those who deride me use me as a curse.","For I have eaten ashes like bread, / And have mixed my drink with weeping,","Because of Your indignation and Your wrath; / For You have taken me up and cast me away.","My days are like a shadow that declines, / And I am dried up like grass.","But You, O Jehovah, abide forever; / And Your memorial is from generation to generation.","You will arise and have compassion on Zion, / For it is time to be gracious to her; the appointed time has come.","For Your servants take pleasure in her stones, / And show favor to her dust.","And the nations will fear the name of Jehovah, / And all the kings of the earth, Your glory;","For Jehovah has built up Zion; / He has appeared in His glory.","He has regarded the prayer of the destitute, / And has not despised their prayer.","This will be written for a generation to come, / And a people to be created will praise Jehovah.","For He has looked down from the height of His sanctuary; / From heaven Jehovah beheld the earth,","To hear the groaning of the prisoner, / To release those appointed to die;","That the name of Jehovah may be declared in Zion, / And His praise, in Jerusalem,","When the peoples are gathered together, / And the kingdoms, to serve Jehovah.","He has weakened my strength in the way; / He has shortened my days.","I said, My God, / Do not take me away in the middle of my days; / Your years are throughout all generations.","Of old You laid the foundation of the earth, / And the heavens are the work of Your hands.","They will perish, but You endure; / Indeed all of them will wear out like a garment; / Like clothing You will change them, / And they will be changed.","But You are the same, / And Your years are without end.","The children of Your servants will continue, / And their seed will be established before You."],["Bless Jehovah, O my soul; / And all that is within me, bless His holy name.","Bless Jehovah, O my soul; / And do not forget all His benefits:","He pardons all your iniquities; / He heals all your diseases;","He redeems your life from the pit; / He crowns you with lovingkindness and compassions;","He satisfies the prime of your life with good, / So that your youth is renewed like the eagle.","Jehovah executes righteous acts, / And judgments for all who are oppressed.","He made His ways known to Moses; / His acts, to the children of Israel.","Jehovah is compassionate and gracious, / Long-suffering and abundant in lovingkindness.","He will not always contend with us, / Nor will He keep His anger forever.","He has not dealt with us according to our sins, / Nor has He recompensed us according to our iniquities.","For as high as the heavens are above the earth, / So great is His lovingkindness upon those who fear Him.","As far as the east is from the west, / So far has He removed our transgressions from us.","As compassionate as a father is toward his children, / So compassionate is Jehovah toward those who fear Him.","For He knows our frame; / He remembers that we are dust.","Man — his days are like grass; / He flourishes like a field flower:","For the wind passes over it, and it is no more; / And its own place knows of it no longer.","But Jehovah’s lovingkindness is from eternity / Unto eternity upon those who fear Him, / And His righteousness is to the children’s children;","To those who keep His covenant / And remember His precepts so as to do them.","Jehovah has established His throne in the heavens, / And His kingdom rules over all.","Bless Jehovah, you His angels, / Who are mighty in strength to perform His word, / By obeying the voice of His word.","Bless Jehovah, all you His hosts, / You His ministers who execute His will.","Bless Jehovah, all you His works, / In all places of His dominion. / Bless Jehovah, O my soul."],["Bless Jehovah, O my soul. / O Jehovah my God, You are very great. / You are clothed with majesty and splendor,","Wrapped with light as with a garment; / You stretch out the heavens like a tent curtain.","He lays the beams of His upper chambers in the waters; / He makes the clouds His chariot; / He walks upon the wings of the wind.","He makes winds His messengers, / Flames of fire His ministers.","He established the earth upon its foundations, / So that it cannot be moved forever and ever.","You covered it with the deep as with a garment; / The waters stood above the mountains.","At Your rebuke they fled; / At the voice of Your thunder they rushed away — ","The mountains rose, the valleys sank — / To the place that You established for them.","You set a border that they may not pass over, / That they may not turn back to cover the earth.","He makes the springs gush forth in the valleys; / They run among the mountains;","They give drink to every beast of the field; / The wild asses quench their thirst.","The birds of heaven dwell alongside them; / They utter their voice among the branches.","He waters the mountains from His upper chambers. / The earth is satisfied with the fruit of Your works.","He causes the grass to grow for the cattle, / And herbage for man’s use, / That he may bring forth food from the earth:","Even wine that cheers man’s heart, / Oil that makes his face shine, / And bread that sustains man’s heart.","The trees of Jehovah are full of sap, / The cedars of Lebanon, which He planted,","Where the birds build their nests; / As for the stork, the cypresses are her house.","The high mountains are for the wild goats; / The cliffs are a refuge to the rock badgers.","He made the moon to mark seasons; / The sun knows the time of its going down.","You make darkness, and it is night, / In which all the beasts of the forest creep about.","The young lions roar after their prey, / Even to seek their food from God.","The sun rises: they retreat / And lie down in their dens.","Man goes forth to his work / And to his labor until evening.","How many are Your works, O Jehovah! / In wisdom You have made all of them; / The earth is full of Your creatures.","Yonder is the sea, great and extensively wide; / There the creeping things are, even without number, / The small animals with the great.","There the ships go; / Leviathan is there, whom You have formed / To play in it.","They all wait for You, / That You may give them food at the proper time.","You give to them; they gather. / You open Your hand; they are satisfied with good.","You hide Your face; they are troubled. / You take away their breath; they perish, / And return to their dust.","You send forth Your Spirit; they are created, / And You renew the surface of the ground.","May the glory of Jehovah endure forever! / May Jehovah rejoice in His works,","He who looks on the earth, and it trembles; / He who touches the mountains, and they smoke!","I will sing to Jehovah while I live; / I will sing psalms to my God while I yet have being.","May my musing be sweet to Him; / I will rejoice in Jehovah.","May the sinners be consumed from off the earth, / And may the wicked be no more. / Bless Jehovah, O my soul. / Hallelujah."],["Give thanks to Jehovah; call upon His name; / Make known His deeds among the peoples.","Sing to Him; sing psalms to Him; / Muse upon all His wondrous deeds.","Glory in His holy name; / Let the heart of those who seek Jehovah rejoice.","Seek Jehovah and His strength; / Seek His face continually.","Remember His wondrous deeds, which He has done, / His signs and the judgments of His mouth,","O seed of Abraham His servant, / O children of Jacob, His chosen ones.","He is Jehovah our God; / His judgments are in all the earth.","He has remembered His covenant forever, / The word that He commanded to a thousand generations,","The covenant that He made with Abraham, / And His oath unto Isaac.","And He confirmed it unto Jacob as a statute, / Unto Israel as an eternal covenant,","Saying, To you I will give the land of Canaan, / The portion of your inheritance;","When they were men few in number, / Indeed very few and strangers in the land.","And they went about from nation to nation, / From one kingdom to another people.","He allowed no man to oppress them; / Indeed He rebuked kings for their sake.","Saying, Do not touch My anointed ones, / And do My prophets no harm.","And He called a famine upon the land; / He broke the whole staff of bread.","He sent a man before them; / Joseph was sold as a servant.","They afflicted his feet with fetters; / He himself was placed in irons.","Until the time when his word came to pass, / The word of Jehovah tried him.","The king sent men and freed him, / Even the ruler of the peoples, and let him go.","He made him lord of his house / And ruler over all his possessions,","To imprison his princes at will, / And to teach his elders wisdom.","Then Israel came into Egypt, / And Jacob sojourned in the land of Ham.","And He made His people very fruitful, / And caused them to be mightier than their adversaries.","He turned their heart to hate His people, / To deal craftily with His servants.","He sent Moses His servant, / And Aaron, whom He had chosen.","They set His signs among them, / And wonders in the land of Ham.","He sent darkness and made it dark; / And they did not rebel against His words.","He turned their waters into blood, / And killed their fish.","Their land teemed with frogs, / Even in the chambers of their kings.","He spoke, and a swarm of flies came; / There were lice within all their borders.","He gave them hail for rain, / And flaming fire in their land.","He struck their vines and their fig trees, / And He broke the trees of their borders.","He spoke, and the swarming locusts came, / And the licking locusts, even without number.","And they ate every herb in their land, / And they ate the fruit of their ground.","He struck all the firstborn in their land, / The firstfruits of all their vigor.","And He brought them out with silver and gold, / And there was none among His tribes who stumbled.","Egypt rejoiced at their going forth, / For a dread of them had fallen upon them.","He spread a cloud for a covering, / And a fire to give light by night.","They asked, and He brought quails; / And He satisfied them with the bread of heaven.","He opened the rock, and water gushed forth; / It ran in the dry places like a river.","For He remembered His holy word / And Abraham His servant.","And He brought forth His people with gladness, / His chosen ones with a ringing shout.","And He gave them the lands of the nations, / And they took possession of the labor of the peoples,","So that they might keep His statutes / And observe His laws. / Hallelujah."],["Hallelujah. / Give thanks to Jehovah, for He is good, / For His lovingkindness is forever.","Who can utter the mighty acts of Jehovah, / Or declare all His praise?","Blessed are those who maintain justice, / Who execute righteousness at all times.","Remember me, O Jehovah, with Your favor toward Your people; / Visit me with Your salvation,","That I may see the prosperity of Your chosen ones, / That I may rejoice in the joy of Your nation, / That I may glory with Your inheritance.","We have sinned with our fathers; / We committed iniquity; we have acted wickedly.","Our fathers in Egypt / Did not understand Your wonders; / They did not remember the multitude of Your acts of lovingkindness, / But rebelled by the sea, at the Red Sea.","But He saved them for His name’s sake, / That He might make His power known.","Thus He rebuked the Red Sea, and it dried up; / And He led them through the depths as through the wilderness.","And He saved them from the hand of him who hated them, / And redeemed them from the hand of the enemy.","The water then covered their adversaries; / Not one of them was left.","Then they believed His words; / They sang His praise.","Soon they forgot His works; / They did not wait for His counsel,","But lusted exceedingly in the wilderness, / And tempted God in the desert.","And He gave them their request, / But He sent leanness into their soul.","And they were jealous of Moses in the camp / And of Aaron, the holy one of Jehovah.","The earth opened, and it swallowed up Dathan / And covered the company of Abiram.","And a fire burned among their company; / A flame engulfed the wicked.","They made a calf in Horeb, / And worshipped a molten image.","Thus they exchanged their glory / For the image of an ox that eats grass.","They forgot God their Savior, / Who had done great things in Egypt,","Wondrous deeds in the land of Ham, / Awesome things by the Red Sea.","Therefore He said that He would destroy them, / And would have, had not Moses His chosen one / Stood in the breach before Him / To turn away His wrath from destroying them.","Then they despised the pleasant land; / They did not believe in His word;","Rather they murmured in their tents; / They did not listen to the voice of Jehovah.","Therefore He lifted up His hand and swore to them / That He would make them fall in the wilderness,","And that He would make their seed fall among the nations, / And that He would disperse them among the lands.","Then they joined themselves to Baal-peor, / And ate sacrifices offered to the dead.","Thus they provoked Him to anger by their actions, / And the plague broke out among them.","Then Phinehas stood up and intervened, / And the plague was stayed;","And it has been accounted to him as righteousness / From generation to generation unto eternity.","Then they angered Him at the waters of Meribah, / So that it went ill with Moses on account of them;","For they rebelled against His Spirit, / And he spoke rashly with his lips.","They did not destroy the peoples, / As Jehovah had commanded them;","But they mingled themselves with the nations / And learned their practices.","And they served their idols, / Which became a snare to them.","They also sacrificed their sons / And their daughters to demons,","And poured out innocent blood, / The blood of their sons and daughters, whom they sacrificed to the idols of Canaan; / And the land was polluted with bloodshed.","Thus they were defiled by their practices, / And went about as harlots by their actions.","And the anger of Jehovah was kindled against His people, / And He abhorred His inheritance.","And He gave them over into the hand of the nations: / And those who hated them ruled over them,","And their enemies oppressed them, / And they were subdued under their hand.","Many times He delivered them, / But they were rebellious in their counsel, / And they were brought low in their iniquity.","Yet He regarded their distress / When He heard their cry,","And for their sake He remembered His covenant, / And repented according to the multitude of His acts of lovingkindness;","And He caused them to find compassion / With all their captors.","Save us, O Jehovah our God; / And gather us out of the nations, / That we may give thanks to Your holy name, / That we may glory in Your praise.","Blessed be Jehovah the God of Israel, / From eternity to eternity. / And let all the people say, Amen. / Hallelujah."],["Give thanks to Jehovah, for He is good, / For His lovingkindness is forever.","Let the redeemed of Jehovah say so, / Whom He redeemed from the hand of the adversary,","And gathered out of the lands, / From the east and from the west, / From the north and from the south.","They wandered in the wilderness, on the desert way; / They found no city of habitation.","Hungry and thirsty, / Their soul fainted within them.","Then they cried out to Jehovah in their trouble, / And He delivered them from their distresses.","And He led them on a straight way / That they might come to a city of habitation.","Let them give thanks to Jehovah for His lovingkindness / And for His wondrous deeds to the children of men.","For He satisfies the thirsty soul, / And the famished soul He fills with good.","Some inhabited darkness and the shadow of death, / And were bound in affliction and irons,","Because they rebelled against the words of God / And spurned the counsel of the Most High;","Therefore He brought down their heart with labor; / They stumbled, and there was no one to help them.","Then they cried out to Jehovah in their trouble, / And He saved them from their distresses.","He brought them out of darkness and the shadow of death, / And He broke apart their bonds.","Let them give thanks to Jehovah for His lovingkindness / And for His wondrous deeds to the children of men.","For He breaks down the doors of bronze / And cuts down the bars of iron.","Some were fools, because of their way of transgression; / And because of their iniquities, they were afflicted.","Their soul loathed all food, / And they drew near to the gates of death.","Then they cried out to Jehovah in their trouble, / And He saved them out of their distresses.","He sent forth His word and healed them, / And He delivered them from the pits of destruction.","Let them give thanks to Jehovah for His lovingkindness / And for His wondrous deeds to the children of men.","And let them offer sacrifices of thanksgiving / And declare His doings in joyful song.","Those who go down to the sea in ships, / Conducting business on the mighty waters,","These see Jehovah’s doings / And His wondrous deeds in the deep.","For He commanded and raised up a storm wind, / And it lifted up the waves of the sea.","They mounted up to the heavens; they went down to the depths; / Their soul melted in the calamity.","They reeled and staggered like a drunken man, / And all their skill was swallowed up.","Then they cried out to Jehovah in their trouble, / And He brought them out of their distresses.","He made the storm be still, / And the waves of the sea were calm;","And they rejoiced that they were quiet, / And He brought them to the haven they desired.","Let them give thanks to Jehovah for His lovingkindness / And for His wondrous deeds to the children of men.","And let them exalt Him in the congregation of the people / And praise Him in the assembly of the elders.","He turns rivers into a wilderness, / And springs of water into thirsty ground;","Fruitful land into a salt flat, / Because of the wickedness of those who dwell in it.","He turns a wilderness into a pool of water, / And a dry land into springs of water.","And He makes the hungry dwell there, / That they may prepare a city of habitation","And sow fields and plant vineyards / And get a fruitful yield.","He also blesses them, and they are multiplied greatly; / And He does not let their cattle decrease.","When they are diminished and bowed down / Through oppression, trouble, and sorrow,","He pours contempt on princes, / And makes them wander in a pathless waste.","But He raises the needy man high above affliction / And makes his families like flocks.","The upright see it and rejoice; / And all iniquity stops its mouth.","Who is wise? Then let him observe these things / And consider the lovingkindness of Jehovah."],["My heart is fixed, O God; / I will sing, indeed I will sing psalms, / Even with my glory.","Awake, O harp and lyre! / I will awaken the dawn.","I will give thanks to You among the peoples, O Jehovah; / And I will sing psalms to You among the nations.","For Your lovingkindness is higher than the heavens, / And Your faithfulness reaches to the sky.","Be exalted above the heavens, O God; / And let Your glory be above all the earth.","That Your beloved ones may be delivered, / Save with Your right hand, and answer us.","God has spoken in His holiness: I will exult; / I will divide Shechem / And measure out the Valley of Succoth.","Gilead is Mine; Manasseh is Mine; / And Ephraim is the helmet for My head; / Judah is My scepter.","Moab is My washbowl; / Upon Edom I will cast My sandal; / Over Philistia I will shout.","Who will bring me into the fortified city? / Who will lead me to Edom?","Will not You, O God, who rejected us / And who did not go forth, O God, with our armies?","Give us help from the adversary, / For a salvation by man is vain.","In God we will do valiantly, / And it is He who will tread down our adversaries."],["O God of my praise, do not be silent;","For the mouth of the wicked man and the mouth of deceit are opened against me; / They speak to me with a lying tongue.","And with words of hatred they have surrounded me / And have fought against me without cause.","In return for my love they have become my adversaries, / But I am all prayer.","And they have set against me evil in return for good / And hatred in return for my love.","Appoint a wicked man over him, / And let an adversary stand at his right hand.","When he is judged, let him come forth wicked; / And let his prayer be counted as sin.","May his days be few; / May another take his office.","May his children be orphans, / And his wife a widow.","And may his children wander all about and beg, / And may they seek food far from their desolated ruins.","May the creditor seize all that he has, / And may strangers plunder the fruit of his labor.","May there be no one to extend him mercy, / Nor anyone to be kind to his orphans.","May his posterity be cut off; / In the generation following may his name be blotted out.","May his fathers’ iniquity be remembered before Jehovah, / And may his mother’s sin not be blotted out.","May they be before Jehovah continually, / So that He may cut off the memory of them from the earth;","Because he did not remember to show lovingkindness, / But persecuted the poor and needy and brokenhearted, / To put them to death.","Indeed he loved cursing, so it came on him; / And he took no delight in blessing, so it was far from him.","And he clothed himself with cursing like his garment, / So it came into his inward parts like water / And into his bones like oil.","Let it be to him like the cloak that he wraps around himself, / And as a belt with which he constantly girds himself.","This is the reward from Jehovah for my adversaries / And for those who speak evil against my soul.","But You, O Jehovah Lord, deal with me, / For Your name’s sake; / Because Your lovingkindness is good, deliver me.","For I am poor and needy, / And my heart is wounded within me.","I am gone like a shadow that declines; / I am shaken off like the locust.","My knees wobble through fasting, / And my flesh has become lean, without fatness.","I have also become a reproach to them: / When they see me, they shake their heads.","Help me, O Jehovah my God; / Save me according to Your lovingkindness;","And they will know that this is Your hand, / That it is You, O Jehovah, who have done it.","Let them curse, but You bless; / When they arise, they will be put to shame, / And Your servant will rejoice.","May my adversaries be clothed with humiliation, / And may they wrap themselves with their own shame as with a mantle.","I will give much thanks to Jehovah with my mouth, / And in the midst of the multitude I will praise Him;","For He stands at the right hand of the needy / To save him from those who judge his soul."],["Jehovah declares to my Lord, / Sit at My right hand / Until I make Your enemies / Your footstool.","Jehovah will send forth / The scepter of Your strength from Zion: / Rule in the midst of Your enemies.","Your people will offer themselves willingly / In the day of Your warfare, / In the splendor of their consecration. / Your young men will be to You / Like the dew from the womb of the dawn.","Jehovah has sworn, / And He will not change: / You are a Priest forever / According to the order of Melchizedek.","The Lord is at Your right hand; / He will shatter kings in the day of His anger.","He will execute judgment among the nations; / He will fill the place with corpses; / He will shatter the head / Over a great land.","He will drink from the brook by the way; / Therefore He will lift up His head."],["Hallelujah! / I will give thanks to Jehovah with all my heart / In the council of the upright and in the assembly.","Great are the works of Jehovah, / And sought out by all who delight in them.","His work is majesty and splendor, / And His righteousness endures forever.","He has caused His wondrous deeds to be remembered; / Jehovah is gracious and compassionate.","He gives food to those who fear Him; / He remembers His covenant forever.","He has shown His people the power of His works / By giving them the heritage of the nations.","The works of His hands are truth and justice; / All His precepts are sure:","They are maintained forever and ever, / They are executed in truth and uprightness.","He has sent redemption to His people; / He has commanded His covenant forever; / Holy and awesome is His name.","The fear of Jehovah is the beginning of wisdom; / All who practice His precepts have a good understanding. / His praise endures forever."],["Hallelujah! / Blessed is the man who fears Jehovah, / Who delights greatly in His commandments.","His seed will be mighty on the earth; / The generation of the upright will be blessed.","Wealth and riches are in his house, / And his righteousness endures forever.","Light in the darkness arises to the upright; / They are gracious and compassionate and righteous.","It is well with the man who is gracious and lends; / He will maintain his cause in judgment.","For he will never be moved; / The righteous man will be remembered forever.","He will not be afraid of evil tidings; / His heart is steadfast, trusting in Jehovah.","His heart is sustained, he is not afraid, / Until he sees what should happen to his adversaries.","He has scattered abroad; he has given to the needy; / His righteousness endures forever; / His horn will be exalted with honor.","The wicked man will see it and be angry; / He will gnash his teeth and melt away; / The desire of the wicked will perish."],["Hallelujah! / Praise, you servants of Jehovah, / Praise the name of Jehovah.","Let the name of Jehovah be blessed, / From now and to eternity.","From the rising of the sun to its setting / The name of Jehovah is to be praised.","Jehovah is high above all the nations, / And His glory is above the heavens.","Who is like Jehovah our God, / Who has set His throne on high,","Who humbles Himself to behold / The heavens and the earth?","He raises the poor from the dust; / From the ash heap He lifts the needy;","That He may seat them with princes, / With the princes of His people.","He causes the barren woman to keep house / As a joyful mother of children. / Hallelujah."],["When Israel went forth from Egypt, / The house of Jacob from among a people of unintelligible speech,","Judah became His sanctuary, / Israel, His dominion.","The sea saw and fled; / The Jordan turned back.","The mountains skipped like rams, / The hills, like lambs.","What troubles you, O sea, that you flee? / O Jordan, that you turn back?","O mountains, that you skip like rams? / O hills, like lambs?","Tremble at the presence of the Lord, O earth, / At the presence of the God of Jacob,","Who turns the rock into a pool of water, / The flint into a fountain of water."],["Not to us, O Jehovah, not to us, / But to Your name give glory, / For the sake of Your lovingkindness and Your truth.","Why should the nations say, / Where then is their God?","But our God is in the heavens; / He does whatever He pleases.","Their idols are mere silver and gold, / The work of human hands.","They have mouths, but they do not speak; / They have eyes, but they do not see.","They have ears, but they do not hear; / They have noses, but they do not smell.","They have hands, but they do not feel; / They have feet, but they do not walk; / They make no sound in their throat.","Those who make them, / All who trust in them, / Are like them.","O Israel, trust in Jehovah. / He is their help and their shield.","O house of Aaron, trust in Jehovah. / He is their help and their shield.","O you who fear Jehovah, trust in Jehovah. / He is their help and their shield.","Jehovah has been mindful of us; He will bless us; / He will bless the house of Israel; / He will bless the house of Aaron;","He will bless those who fear Jehovah, / Both small and great.","May Jehovah give you increase, / Both you and your children.","May you be blessed of Jehovah, / Maker of heaven and earth.","The heavens are the heavens of Jehovah, / But He has given the earth to the children of men.","The dead do not praise Jehovah, / Nor do any that go down into silence.","But we will bless Jehovah / From now and to eternity. / Hallelujah."],["I love Jehovah because He hears / My voice, my supplications,","Because He inclines His ear to me; / Therefore I will call upon Him all my days.","The bonds of death encompassed me, / And the distresses of Sheol fell upon me; / I fell upon trouble and sorrow.","But I called upon the name of Jehovah. / O Jehovah, I pray, deliver my soul.","Jehovah is gracious and righteous, / Indeed our God is compassionate.","Jehovah preserves the simple: / I was brought low, and He saved me.","Return to your rest, O my soul; / For Jehovah has dealt bountifully with you.","For You have delivered my soul from death, / My eyes from tears, / My feet from stumbling.","I will walk before Jehovah / In the land of the living.","I believed, therefore I spoke; / I was afflicted greatly.","I said in my haste, / All men are liars.","What shall I return to Jehovah / For all His benefits toward me?","I will take up the cup of salvation / And call upon the name of Jehovah.","I will pay my vows to Jehovah, / Oh, in the presence of all His people.","Precious in the sight of Jehovah / Is the death of His faithful ones.","O Jehovah! / Surely I am Your servant; / I am Your servant, the son of Your female servant; / You have loosed my bonds.","To You I will offer a sacrifice of thanksgiving, / And I will call upon the name of Jehovah.","I will pay my vows to Jehovah, / Oh, in the presence of all His people,","In the courts of the house of Jehovah, / In the midst of you, O Jerusalem. / Hallelujah."],["Praise Jehovah, all you nations; / Laud Him, all you peoples.","For His lovingkindness is great toward us, / And the faithfulness of Jehovah is forever. / Hallelujah."],["Give thanks to Jehovah, for He is good, / For His lovingkindness is forever.","Let Israel say, / His lovingkindness is forever.","Let the house of Aaron say, / His lovingkindness is forever.","Let those who fear Jehovah say, / His lovingkindness is forever.","Out of my distress I called upon Jehovah; / Jehovah answered me and set me in a place broad and free.","Jehovah is for me; I will not be afraid. / What can man do to me?","Jehovah is for me as my Helper, / And I will see what should happen to those who hate me.","It is better to take refuge in Jehovah / Than to trust in man.","It is better to take refuge in Jehovah / Than to trust in princes.","All nations surrounded me; / In the name of Jehovah I indeed cut them down!","They surrounded me; yes, they surrounded me; / In the name of Jehovah I indeed cut them down!","They surrounded me like bees; / They were extinguished like a fire of thorns; / In the name of Jehovah I indeed cut them down!","I was pushed hard that I might fall; / But Jehovah helped me.","Jehovah is my strength and my song, / And He has become my salvation.","The voice of rejoicing and salvation / Is in the tents of the righteous. / The right hand of Jehovah does valiantly;","The right hand of Jehovah is exalted; / The right hand of Jehovah does valiantly.","I will not die, but live, / And declare the works of Jehovah.","Jehovah has severely chastened me, / But He has not given me over to death.","Open to me the gates of righteousness: / I will enter in through them; I will give thanks to Jehovah.","This is the gate of Jehovah; / The righteous shall enter in through it.","I will give thanks to You, for You have answered me / And have become my salvation.","The stone which the builders rejected / Has become the head of the corner.","This is from Jehovah; / It is wonderful in our sight.","This is the day that Jehovah has made; / Let us exult and rejoice in it.","O Jehovah, do save, we pray! / O Jehovah, do send prosperity, we pray!","Blessed is He who comes in the name of Jehovah; / We bless you from the house of Jehovah.","Jehovah is God, / And He has given us light; / Bind the sacrifice of the feast with cords / To the horns of the altar.","You are my God, and I give thanks to You. / You are my God; I will exalt You.","Give thanks to Jehovah, for He is good, / For His lovingkindness is forever."],["Blessed are those whose way is perfect, / Who walk in the law of Jehovah.","Blessed are those who keep His testimonies, / Who seek Him with all their heart.","Surely they do no wrong; / They walk in His ways.","You have commanded that Your precepts / Be diligently kept.","Oh that my ways may be established / So as to keep Your statutes!","Then I will not be put to shame, / When I regard all Your commandments.","I will give thanks to You with uprightness of heart / When I learn Your righteous ordinances.","I will keep Your statutes; / Do not utterly forsake me.","With what should a young man keep his way pure? / By guarding it according to Your word.","With all my heart I have sought You; / Do not let me wander from Your commandments.","In my heart I have treasured up Your word / That I might not sin against You.","Blessed are You, O Jehovah; / Teach me Your statutes.","With my lips I have declared / All the ordinances of Your mouth.","I have rejoiced in the way of Your testimonies / As much as in all riches.","I will muse upon Your precepts / And regard Your ways.","I will take delight in Your statutes; / I will not forget Your word.","Deal bountifully with Your servant that I may live / And keep Your word.","Open my eyes that I may behold / Wondrous things out of Your law.","I am a sojourner in the earth; / Do not hide Your commandments from me.","My soul is crushed with longing / For Your ordinances at all times.","You have rebuked the proud, the cursed, / Who wander from Your commandments.","Roll away from me reproach and contempt, / For I have kept Your testimonies.","Princes as well have sat and spoken against me, / But Your servant mused upon Your statutes.","Also Your testimonies are my delight; / They are my counselors.","My soul clings to the dust; / Enliven me according to Your word.","I have recounted my ways, and You have answered me; / Teach me Your statutes.","Cause me to understand the way of Your precepts, / And I will muse upon Your wondrous deeds.","My soul melts because of grief; / Strengthen me according to Your word.","Remove from me the way of falsehood, / And graciously grant me Your law.","I have chosen the way of faithfulness; / Your ordinances I have set before me.","I cling to Your testimonies; / O Jehovah, do not put me to shame.","I run the way of Your commandments, / For You enlarge my heart.","Teach me, O Jehovah, the way of Your statutes; / And I will keep it to the end.","Give me understanding, and I will observe Your law; / Indeed I will keep it with all my heart.","Cause me to go on the path of Your commandments, / For in it I delight.","Incline my heart to Your testimonies / And not to unjust gain.","Turn my eyes from beholding vanity, / And enliven me in Your ways.","Confirm to Your servant Your word, / Which is for fearing You.","Turn away my reproach, which I fear; / For Your ordinances are good.","Behold, I have longed after Your precepts; / Enliven me in Your righteousness.","May Your lovingkindness also come to me, O Jehovah, / Your salvation according to Your word.","Thus I will have an answer for him who reproaches me, / For I trust in Your word.","And do not take the word of truth utterly from my mouth, / For I have hoped in Your ordinances.","Thus I will keep Your law continually, / Forever and ever.","And I will walk at liberty, / For I have sought Your precepts.","I will also speak of Your testimonies before kings / And not be ashamed.","And I will take delight in Your commandments, / Which I love.","And I will lift up my hand to Your commandments, which I love; / And I will muse upon Your statutes.","Remember the word to Your servant / In which You have made me hope.","This is my comfort in my affliction, / For Your word has enlivened me.","The proud have derided me greatly; / I have not swerved from Your law.","I have remembered Your ordinances from long ago, / O Jehovah, and have comforted myself.","Raging indignation seizes me because of the wicked, / Who forsake Your law.","Your statutes have become my songs of praise / In the house of my pilgrimage.","I have remembered Your name / In the night, O Jehovah, / And have kept Your law.","This has been mine, / That I have kept Your precepts.","Jehovah is my portion; / I have promised to keep Your words.","I entreated Your favor with my whole heart; / Be gracious to me according to Your word.","I considered my ways / And turned my feet toward Your testimonies.","I hurried and did not delay / To keep Your commandments.","The cords of the wicked surround me, / But I have not forgotten Your law.","At midnight I rise up to give thanks to You / Because of Your righteous ordinances.","I am a companion to all who fear You / And to those who keep Your precepts.","Your lovingkindness, O Jehovah, fills the earth; / Teach me Your statutes.","You have dealt well with Your servant, / O Jehovah, according to Your word.","Teach me proper discernment and knowledge, / For I believe in Your commandments.","Before I was afflicted, I went astray; / But now I keep Your word.","You are good and One who does good; / Teach me Your statutes.","The proud have plastered lies against me; / With my whole heart I will keep Your precepts.","Their heart is heavy as with fat; / But I delight in Your law.","It is good for me that I have been afflicted, / That I might learn Your statutes.","The law of Your mouth is better to me / Than thousands of pieces of gold and silver.","Your hands have made me and fashioned me; / Give me understanding that I may learn Your commandments.","Those who fear You will see me and rejoice, / For I have hoped in Your word.","I know, O Jehovah, that Your judgments are righteous / And that in faithfulness You afflicted me.","Let Your lovingkindness, I beseech You, be my comfort, / According to Your word to Your servant.","Let Your compassions come to me, and I will live; / For Your law is my delight.","Let the proud be put to shame, for they have subverted my cause with a lie; / But I will muse upon Your precepts.","Let those who fear You turn to me, / And they will know Your testimonies.","May my heart be perfect in Your statutes, / That I may not be put to shame.","My soul faints while longing for Your salvation; / I hope in Your word.","My eyes faint while longing for Your word, / As I say, When will You comfort me?","For I have become like a wineskin in the smoke; / But I do not forget Your statutes.","How many are the days of Your servant? / When will You execute judgment upon my persecutors?","The proud have dug pits for me, / Those who are not according to Your law.","All Your commandments are faithful; / They persecute me falsely; help me.","They have almost consumed me upon the earth; / But I have not forsaken Your precepts.","Enliven me according to Your lovingkindness, / And I will keep the testimony of Your mouth.","Forever, O Jehovah, / Does Your word stand firm in heaven.","Your faithfulness is from generation to generation; / You established the earth, and it abides.","They abide to this day according to Your ordinances, / For all things are Your servants.","Unless Your law had been my delight, / I would have perished in my affliction.","I will never forget Your precepts, / For by them You have enlivened me.","I am Yours; save me, / For I have sought Your precepts.","The wicked have waited for me in order to destroy me, / But I consider Your testimonies.","I have seen an end to all perfection, / But Your commandment is all-expansive.","Oh, how I love Your law! / All day long it is my musing.","Your commandments make me wiser than my enemies, / For they are always with me.","I have more insight than all my teachers, / For Your testimonies are my musing.","I understand more than the aged, / For I have kept Your precepts.","I have withheld my feet from every evil way, / That I might keep Your word.","I have not turned aside from Your ordinances, / For You have taught me.","How sweet are Your words to my taste! / Sweeter than honey to my mouth!","Through Your precepts I gain understanding; / Therefore I hate every false way.","Your word is a lamp to my feet / And a light to my path.","I have sworn and will confirm it, / That I will keep Your righteous ordinances.","I have been greatly afflicted; / O Jehovah, enliven me according to Your word.","Accept, I pray, the freewill offerings of my mouth, O Jehovah; / And teach me Your ordinances.","My soul is continually in my hand, / But I do not forget Your law.","The wicked have laid a trap for me, / But I do not stray from Your precepts.","Your testimonies are my heritage forever, / For they are the gladness of my heart.","I have inclined my heart to perform Your statutes / Forever, to the end.","I hate those who are double-minded, / But I love Your law.","You are my hiding place and my shield; / In Your word do I hope.","Depart from me, you evildoers, / That I may keep the commandments of my God.","Uphold me according to Your word that I may live, / And do not let me be ashamed of my hope.","Hold me up that I may be safe, / And I will regard Your statutes continually.","You spurn all those who stray from Your statutes, / For their deceitfulness is vain.","You do away with all the wicked ones of the earth like dross; / Therefore I love Your testimonies.","My flesh trembles for fear of You, / And I am afraid of Your judgments.","I have performed judgment and righteousness; / Do not leave me to my oppressors.","Guarantee Your servant’s well-being; / Do not let the proud oppress me.","My eyes faint while longing for Your salvation / And for Your righteous word.","Deal with Your servant according to Your lovingkindness, / And teach me Your statutes.","I am Your servant; give me understanding, / That I may know Your testimonies.","It is time for Jehovah to act, / For they have broken Your law.","Therefore I love Your commandments / More than gold, indeed, more than fine gold;","Therefore I esteem all Your precepts concerning all things to be right, / And I hate every false way.","Your testimonies are wonderful; / Therefore my soul keeps them.","The opening of Your words gives light, / Imparting understanding to the simple.","I opened my mouth wide and panted, / For I longed for Your commandments.","Turn to me, and be gracious to me, / As is Your custom with those who love Your name.","Establish my footsteps in Your word, / And do not let any iniquity have dominion over me.","Redeem me from man’s oppression, / That I may keep Your precepts.","Cause Your face to shine on Your servant, / And teach me Your statutes.","My eyes shed streams of water, / Because men do not keep Your law.","You are righteous, O Jehovah; / And Your judgments are upright.","You have commanded Your testimonies in righteousness / And great faithfulness.","My zeal has consumed me, / For my adversaries have forgotten Your words.","Your word is very pure, / And Your servant loves it.","I am small and despised, / But I do not forget Your precepts.","Your righteousness is an eternal righteousness, / And Your law is truth.","Distress and anguish have come upon me, / But Your commandments are my delight.","Your testimonies are righteous forever; / Give me understanding, and I will live.","I called with my whole heart; answer me, O Jehovah. / I will keep Your statutes.","I called upon You; save me, / And I will observe Your testimonies.","I anticipated the dawn and cried out; / I hoped in Your words.","My eyes anticipated the night watches, / That I might muse upon Your word.","Hear my voice according to Your lovingkindness; / O Jehovah, according to Your ordinances enliven me.","Those who persecute me with evil intent draw near; / They are far from Your law.","You are near, O Jehovah; / And all Your commandments are truth.","Of old I have known from Your testimonies / That You have founded them forever.","Look at my affliction, and deliver me; / For I have not forgotten Your law.","Plead my case, and redeem me; / Enliven me according to Your word.","Salvation is far from the wicked, / For they do not seek Your statutes.","Great are Your compassions, O Jehovah; / Enliven me according to Your ordinances.","Many are my persecutors and my adversaries, / But I have not swerved from Your testimonies.","I saw the treacherous and loathed them, / Because they did not keep Your word.","See how I have loved Your precepts; / O Jehovah, enliven me according to Your lovingkindness.","The sum of Your word is truth, / And all Your righteous ordinances are forever.","Princes have persecuted me without cause, / But my heart stands in awe of Your words.","I rejoice at Your word, / Like one who finds great spoil.","I hate and abhor falsehood, / But I love Your law.","Seven times a day I praise You / For Your righteous ordinances.","There is great peace for those who love Your law, / And there is no occasion of stumbling for them.","I have hoped for Your salvation, O Jehovah; / And I have done Your commandments.","My soul has kept Your testimonies, / And I love them very much.","I have kept Your precepts and Your testimonies, / For all my ways are before You.","Let my cry come before You, O Jehovah; / Give me understanding according to Your word.","Let my supplication come before You; / Deliver me according to Your word.","Let my lips pour forth praise, / For You teach me Your statutes.","Let my tongue sing of Your word, / For all Your commandments are righteousness.","Let Your hand be ready to help me, / For I have chosen Your precepts.","I have longed for Your salvation, O Jehovah, / And Your law is my delight.","Let my soul live, and it will praise You; / And let Your ordinances help me.","I have gone astray like a lost sheep; seek Your servant, / For I have not forgotten Your commandments."],["In my distress I called out to Jehovah, / And He answered me.","O Jehovah, deliver my soul from lying lips, / From a tongue of deceit.","What should be given to you, / And what further shall be done to you, / O tongue of deceit?","The sharp arrows of a mighty man, / With the burning coals of the broom tree!","Woe is me, for I sojourn in Meshech, / I dwell among the tents of Kedar.","Long has my soul had its dwelling / With him who hates peace.","I am for peace; but when I speak, / They are for war."],["I will lift up my eyes to the hills. / From where will my help come?","My help comes from Jehovah, / Who made heaven and earth.","He will not let your foot slip; / He who keeps you will not slumber.","Behold, Israel’s Keeper / Will neither slumber nor sleep.","Jehovah is your Keeper; / Jehovah is your shade at your right hand.","The sun will not strike you by day, / Nor the moon by night.","Jehovah will keep you from all evil; / He will keep your soul.","Jehovah will keep your going out and your coming in / From now and to eternity."],["I rejoiced when they said to me, / Let us go to the house of Jehovah.","Our feet are standing / Within your gates, O Jerusalem.","Jerusalem has been built as a city / That has been compacted together;","To which the tribes go up, / The tribes of Jehovah — / A testimony for Israel — / To give thanks to the name of Jehovah.","For there thrones are set for judgment, / Thrones of the house of David.","Pray for the peace of Jerusalem. / Those who love you will prosper.","Peace be within your bulwarks, / And prosperity within your citadels.","For my brothers’ and companions’ sake I will now say, / Peace be within you.","For the sake of the house of Jehovah our God / I will seek your good."],["To You do I lift up my eyes, / You who sit enthroned in heaven.","Behold, as the eyes of the servants / Look to the hand of their masters, / As the eyes of a servant girl / Look to the hand of her mistress, / So our eyes look to Jehovah our God, / Until He is gracious to us.","Be gracious to us, O Jehovah, be gracious to us; / For we are greatly filled with contempt.","Our soul is greatly filled / With the scorn of those who are at ease, / With the contempt of the proud."],["If it had not been Jehovah who was on our side, / Let Israel say,","If it had not been Jehovah who was on our side / When men rose up against us;","Then they would have swallowed us up alive / When their anger burned against us;","Then the waters would have washed us away; / The stream would have passed over our soul;","Then the proud waters / Would have passed over our soul.","Blessed be Jehovah, who has not given us / As prey to their teeth.","Our soul has escaped like a bird, / Out of the snare of the fowlers; / The snare is broken, / And we have escaped.","Our help is in the name of Jehovah, / Who made heaven and earth."],["Those who trust in Jehovah are like Mount Zion, / Which cannot be moved but abides forever.","Jerusalem — mountains surround her; / And Jehovah surrounds His people / From now and to eternity.","For the scepter of wickedness will not rest / Upon the allotment of the righteous, / That the righteous would not put forth / Their hands to iniquity.","Do good, O Jehovah, to the good / And to those upright in their hearts.","But as for those who turn aside to their crooked ways, / Jehovah will lead them off with the workers of iniquity. / Peace be upon Israel."],["When Jehovah turned again the captivity of Zion, / We were like those who dream.","At that time our mouth was filled with laughter / And our tongue with a ringing shout. / At that time they said among the nations, / Jehovah has done great things for them.","Jehovah has done great things for us; / We are joyful.","Turn again, O Jehovah, our captivity / Like the streams in the south.","Those who sow in tears / Will reap with a ringing shout.","He who goes forth and weeps, / Bearing seed for scattering, / Will no doubt come in with a ringing shout, / Bearing his sheaves with him."],["Unless Jehovah builds the house, / Those who build it labor in vain. / Unless Jehovah keeps the city, / The guard watches in vain.","It is vain for you to rise up early, / To stay up late, / To eat the bread of toil; / All the same, He gives to His beloved while they sleep.","Behold, children are the heritage of Jehovah, / The fruit of the womb a reward.","Like arrows in the hand of a mighty man, / So are the children of one’s youth.","Blessed is the man / Who fills his quiver with them. / He will not be put to shame / When he speaks with enemies in the gate."],["Blessed is everyone who fears Jehovah, / Who walks in His ways.","You will indeed eat the labor of your hands; / You will be blessed, and it will go well with you.","Your wife will be like a fruitful vine / In the innermost parts of your house. / Your children will be like olive shoots / Round about your table.","Thus will the man be blessed / Who fears Jehovah.","Jehovah bless you from Zion; / And may you see the prosperity of Jerusalem / All the days of your life.","May you also see the children of your children. / Peace be upon Israel."],["Many times have they afflicted me since my youth, / Let Israel say,","Many times have they afflicted me since my youth, / Yet they did not prevail against me.","The plowers plowed on my back; / They made their furrows long.","Jehovah is righteous; / He has cut the cords of the wicked.","May all who hate Zion / Be put to shame and turned back.","May they be like grass on the housetops, / Which withers before it grows up,","With which the reaper does not fill his hand, / Or he who binds sheaves, his bosom.","Nor may those who pass by say, / The blessing of Jehovah be upon you! / We bless you in the name of Jehovah."],["Out of the depths I have called upon You, O Jehovah.","O Lord, hear my voice; / Let Your ears be attentive / To the voice of my supplications.","If You, O Jehovah, marked iniquities, / Who, O Lord, would stand?","But with You there is forgiveness, / That You would be feared.","I wait for Jehovah; my soul waits, / And in His word I hope.","My soul waits for the Lord / More than watchmen for the morning, / Yes, watchmen for the morning.","Hope in Jehovah, O Israel; / For with Jehovah there is lovingkindness, / And with Him abundantly there is redemption;","And it is He who will redeem Israel / From all its iniquities."],["O Jehovah, my heart is not proud, / Nor are my eyes haughty; / Nor do I go about in things too great / Or too wondrous for me.","Surely I have calmed / And quieted my soul, / Like a weaned child with its mother; / Like a weaned child is my soul within me.","Hope in Jehovah, O Israel, / From now and to eternity."],["Remember, O Jehovah, for David’s sake / All his afflictions;","How he swore to Jehovah / And vowed to the Mighty One of Jacob:","I shall not go into the tent of my house; / I shall not go up onto the couch of my bed;","I shall not give sleep to my eyes, / Slumber to my eyelids;","Until I find a place for Jehovah, / A tabernacle for the Mighty One of Jacob.","Behold, we heard of it in Ephrathah; / We found it in the fields of Jaar.","We will go into His tabernacle; / We will worship at His footstool.","Arise, O Jehovah, unto Your resting place, / You and the Ark of Your strength.","Let Your priests be clothed with righteousness, / And let Your faithful ones give a ringing shout.","For the sake of David Your servant, / Do not turn away the face of Your Anointed One.","Jehovah has sworn unto David in truth; / He will not turn from it: / Of the fruit of your body I will set One upon your throne.","If your children keep My covenant / And My testimonies that I will teach them, / Their children also will sit / Upon your throne forever.","For Jehovah has chosen Zion; / He has desired it for His habitation.","This is My resting place forever; / Here will I dwell, for I have desired it.","I will abundantly bless its provision; / I will satisfy its poor with bread.","And its priests I will clothe with salvation, / And its faithful ones will shout with a ringing shout.","There I will cause a horn of David to shoot forth; / I have prepared a lamp for My anointed one.","I will clothe his enemies with shame, / But on him his crown will shine."],["Behold, how good and how pleasant it is / For brothers to dwell in unity!","It is like the fine oil upon the head / That ran down upon the beard, / Upon Aaron’s beard, / That ran down upon the hem of his garments;","Like the dew of Hermon / That came down upon the mountains of Zion. / For there Jehovah commanded the blessing: / Life forever."],["Bless Jehovah now, / All you servants of Jehovah / Who stand by night in the house of Jehovah.","Lift up your hands in the sanctuary, / And bless Jehovah.","May Jehovah, who made heaven and earth, / Bless you from Zion."],["Hallelujah! Praise the name of Jehovah; / Praise Him, you servants of Jehovah,","Who stand in the house of Jehovah, / In the courts of the house of our God.","Praise Jehovah, for Jehovah is good; / Sing psalms to His name, for it is pleasant.","For Jehovah has chosen Jacob for Himself, / Israel for His personal treasure.","For I know that Jehovah is great / And that our Lord is above all gods.","Whatever Jehovah pleases He does / In heaven and on earth, / In the seas and all the depths.","He causes the vapors to ascend from the ends of the earth; / He makes lightning for the rain; / He brings forth wind from His treasuries.","He struck the firstborn of Egypt, / Both of man and of beast.","He sent signs and wonders into your midst, O Egypt, / Upon Pharaoh and all his servants.","He struck many nations / And slew mighty kings:","Sihon the king of the Amorites / And Og the king of Bashan / And all the kingdoms of Canaan.","And He gave their land as an inheritance, / An inheritance to Israel His people.","O Jehovah, Your name is forever; / O Jehovah, Your memorial is from generation to generation.","For Jehovah will execute judgment for His people, / And He will have compassion concerning His servants.","The idols of the nations are mere silver and gold, / The work of human hands.","They have mouths, but they do not speak; / They have eyes, but they do not see.","They have ears, but they do not give ear; / And there is no breath in their mouths.","Those who make them, / All who trust in them, / Will be like them.","O house of Israel, bless Jehovah. / O house of Aaron, bless Jehovah.","O house of Levi, bless Jehovah. / O you who fear Jehovah, bless Jehovah.","Blessed be Jehovah from Zion, / Who dwells in Jerusalem. / Hallelujah."],["Give thanks to Jehovah, for He is good; / For His lovingkindness is forever.","Give thanks to the God of gods, / For His lovingkindness is forever.","Give thanks to the Lord of lords, / For His lovingkindness is forever;","To Him who alone does great wonders, / For His lovingkindness is forever;","To Him who by understanding made the heavens, / For His lovingkindness is forever;","To Him who spread forth the earth over the waters, / For His lovingkindness is forever;","To Him who made the great lights, / For His lovingkindness is forever;","The sun for ruling the day, / For His lovingkindness is forever;","The moon and the stars for ruling the night, / For His lovingkindness is forever;","To Him who struck Egypt in their firstborn, / For His lovingkindness is forever;","And brought forth Israel from their midst, / For His lovingkindness is forever;","With a mighty hand and an outstretched arm, / For His lovingkindness is forever;","To Him who divided the Red Sea apart, / For His lovingkindness is forever;","And brought Israel over through the midst of it, / For His lovingkindness is forever;","And shook off Pharaoh and his force into the Red Sea, / For His lovingkindness is forever;","To Him who marched His people through the wilderness, / For His lovingkindness is forever;","To Him who struck great kings, / For His lovingkindness is forever;","And slew majestic kings, / For His lovingkindness is forever;","Sihon the king of the Amorites, / For His lovingkindness is forever;","And Og the king of Bashan, / For His lovingkindness is forever;","And gave their land as an inheritance, / For His lovingkindness is forever;","An inheritance to Israel His servant, / For His lovingkindness is forever;","Who remembered us in our low estate, / For His lovingkindness is forever;","And rescued us from our adversaries, / For His lovingkindness is forever;","Who gives food to all flesh, / For His lovingkindness is forever.","Give thanks to the God of heaven, / For His lovingkindness is forever."],["By the rivers of Babylon, / There we sat down; indeed, we wept / When we remembered Zion.","On the willows in the midst of it / We hung up our lyres,","For there our captors required of us songs, / And those who tormented us required of us mirth, saying, / Sing for us / One of the songs of Zion.","How can we sing the song of Jehovah / In a foreign land?","If I forget you, O Jerusalem, / Let my right hand forget its skill.","Let my tongue cling to the roof of my mouth, / If I do not remember you, / If I do not prefer Jerusalem / Above my chief joy.","Remember, O Jehovah, / Against the children of Edom, / The day of Jerusalem, / Who said, Lay it bare! Lay it bare, / Down to its foundation!","O daughter of Babylon, who are to be devastated, / Happy will he be who repays you / The recompense of what you have rendered to us.","Happy will he be who seizes your little ones / And dashes them against the rock."],["I will give You thanks with all my heart; / Before the gods I will sing psalms to You.","I will bow toward Your holy temple / And give thanks to Your name / For Your lovingkindness and Your truth, / For You have magnified Your word above all Your name.","On the day that I called out, You answered me; / You encouraged me with strength in my soul.","All the kings of the earth will give thanks to You, O Jehovah; / For they have heard the words of Your mouth.","And they will sing of the ways of Jehovah, / For great is the glory of Jehovah.","For though Jehovah is high, He regards the lowly; / And the haughty He knows from afar.","Though I walk in the midst of trouble, / You will preserve me; / Against the wrath of my enemies You will stretch out Your hand, / And Your right hand will save me.","Jehovah will complete that which concerns me. / O Jehovah, Your lovingkindness is forever; / Do not forsake the works of Your own hands."],["O Jehovah, You have searched me and known me.","You know when I sit down and when I rise up; / You understand my thoughts from afar.","You thoroughly search my path and my lying down, / And You are acquainted with all my ways.","For a word is not yet on my tongue, / And already You, O Jehovah, know it completely.","You have closed in on me behind and before / And have laid Your hand on me.","Oh, knowledge too wonderful for me! / It is so high; I cannot attain to it.","Where shall I go, away from Your Spirit, / And where shall I flee from Your presence?","If I ascend into heaven, You are there; / If I make my bed in Sheol, there You are.","If I take the wings of the dawn / And settle at the limits of the sea,","There also Your hand will lead me, / And Your right hand will take hold of me.","And if I say, Surely darkness will cover me, / And the light around me will be night;","Even the darkness is not dark to You, / And night shines like day; / The darkness is like the light.","For it was You who formed my inward parts; / You wove me together in my mother’s womb.","I will praise You, for I am awesomely and wonderfully made; / Your works are wonderful, / And my soul knows it well.","My frame was not hidden from You / When I was made in secret, / Skillfully fashioned in the depths of the earth.","Your eyes saw my unformed substance; / And in Your book all of them were written: / The days that were ordained for me, / When not one of them was yet.","And how precious are Your thoughts to me, O God! / How great is the sum of them!","If I should count them, they would be more than the sand. / When I awake, I am still with You.","Oh that You, O God, would slay the wicked — / Depart from me therefore, you men of bloodshed — ","Those who speak of You with evil intent, / Who as Your enemies take Your name in vain.","Do I not hate those who hate You, O Jehovah? / And do I not loathe those who rise up against You?","I hate them with a perfect hatred; / They have become my own enemies.","Search me, O God, and know my heart; / Try me, and know my anxious thoughts;","And see if there is some harmful way in me, / And lead me on the eternal way."],["Deliver me, O Jehovah, from evil men; / From violent men preserve me;","Who devise evil schemes in their hearts / And continually stir up wars.","They have sharpened their tongues like that of a serpent; / The poison of adders is under their lips. Selah","Keep me, O Jehovah, from the hands of the wicked; / From violent men preserve me; / Who devise schemes to thrust me down.","The proud have hidden a trap for me and cords; / They have spread a net by the wayside; / They have set snares for me. Selah","I said to Jehovah, You are my God; / Give ear, O Jehovah, to the voice of my supplications.","O Jehovah Lord, strength of my salvation, / You have covered my head in the day of battle.","O Jehovah, do not grant the desires of the wicked man; / Do not let his evil scheme advance, / Lest he be exalted. Selah","As for the head of those who surround me, / May the mischief of their own lips cover them.","May burning coals drop down upon them; / May they be thrown down into the fire, / Into deep pits, never to rise again.","Let no slanderer be established in the land; / Let evil hunt down the violent man speedily.","I know that Jehovah will maintain the cause of the afflicted / And justice for the needy.","Surely the righteous will give thanks to Your name; / The upright will dwell in Your presence."],["O Jehovah, I have called upon You; hasten to me. / Give ear to my voice when I call out to You.","Let my prayer be set before You as incense, / The lifting up of my hands as the evening offering.","Set a watch, O Jehovah, before my mouth; / Keep the door of my lips.","Do not let my heart turn to anything evil, / To practice deeds of wickedness / With men who commit iniquity; / And let me not eat of their delicacies.","Let the righteous strike me in kindness and reprove me; / Let not my head refuse oil upon the head, / For still my prayer is against their evil deeds.","Their judges are thrown down by the sides of the rock, / And they hear my words, that they are pleasant.","As when one plows and breaks up the earth, / Our bones are scattered at the mouth of Sheol.","For my eyes are upon You, O Jehovah Lord; / In You I take refuge; do not pour out my soul.","Keep me from the trap they have set for me / And from the snares of the workers of iniquity.","May the wicked fall into their own nets / While I alone pass by."],["With my voice I cry to Jehovah; / With my voice I make my supplication to Jehovah.","I pour out my complaint before Him; / I declare my trouble before Him.","When my spirit fainted within me, / You knew my path. / On the way on which I walked / They have hidden a trap for me.","Look on my right hand and see, / For there is no one who regards me; / Refuge has failed me; / No one cares for me.","I cried to You, O Jehovah; / I said, You are my refuge, / My portion in the land of the living.","Give heed to my cry, / For I have been brought very low; / Deliver me from those who persecute me, / For they are stronger than I.","Bring my soul out of prison, / That I may give thanks to Your name. / The righteous will surround me, / For You will deal bountifully with me."],["O Jehovah, hear my prayer; / Give ear to my supplications; / Answer me in Your faithfulness and in Your righteousness;","And do not enter into judgment with Your servant, / For no one alive is righteous in Your sight.","For the enemy has persecuted my soul; / He has crushed my life down to the ground; / He has caused me to dwell in dark places, like those who have been long dead.","Therefore my spirit faints within me; / My heart is appalled in the midst of me.","I remember the days of old; / I meditate upon all that You have done; / I muse upon the work of Your hands.","I spread out my hands to You; / My soul thirsts for You like a parched land. Selah","Hurry and answer me, O Jehovah; / My spirit fails. / Do not hide Your face from me, / Lest I become like those who go down into the pit.","Cause me to hear Your lovingkindness in the morning, / For in You I trust. / Make known to me the way on which I should walk, / For to You I lift up my soul.","Deliver me from my enemies, O Jehovah; / I have fled to You for a refuge.","Teach me to do Your will, / For You are my God; / Let Your good Spirit lead me / In a plain country.","For Your name’s sake, O Jehovah, preserve me alive; / In Your righteousness bring my soul out of trouble.","And in Your lovingkindness cut off my enemies / And destroy all those who oppress my soul, / For I am Your servant."],["Blessed be Jehovah my rock, / Who teaches my hands for war / And my fingers for battle:","My Lord of lovingkindness and my fortress, / My high retreat and my Deliverer, / My shield and He in whom I take refuge, / Who subdues my people under me.","O Jehovah, what is man, that You take knowledge of him, / And the son of mortal man, that You think of him?","Man is like a breath; / His days are like a passing shadow.","O Jehovah, bow Your heavens down and descend; / Touch the mountains, and they will smoke.","Flash forth lightning, and scatter them; / Send forth Your arrows, and discomfit them.","Stretch forth Your hand from on high; / Rescue me and deliver me / From the great waters, / From the hand of foreigners,","Whose mouth speaks deceit, / And whose right hand is a right hand of falsehood.","O God, I will sing a new song to You; / Upon a harp of ten strings I will sing psalms to You,","Who gives salvation to kings, / Who rescues David His servant from the hurtful sword.","Rescue me and deliver me from the hand of foreigners, / Whose mouth speaks deceit, / And whose right hand is a right hand of falsehood.","May our sons be like plants / Grown up in their youth; / May our daughters be like corner pillars / Hewn out in fashion for a palace;","May our barns be full, / Furnishing produce of all kinds; / May our sheep bring forth thousands / And ten thousands in our fields;","May our oxen be fully laden; / May there be no breaking in to rob or going forth to fight, / Or outcry in our streets.","Blessed are the people who are so; / Blessed are the people whose God is Jehovah."],["I will extol You, O my God and King; / And I will bless Your name forever and ever.","Every day I will bless You, / And I will praise Your name forever and ever.","Great is Jehovah, and much to be praised; / And His greatness is unsearchable.","One generation will laud Your works to another, / And they will declare Your mighty acts.","Upon the glorious splendor of Your majesty / And upon Your wondrous works I will muse.","And men will speak of the might of Your awesome deeds, / And I will declare Your greatness.","They will utter the memory of Your great goodness / And will sing for joy of Your righteousness.","Jehovah is gracious and compassionate, / Long-suffering and great in lovingkindness.","Jehovah is good to all, / And His compassions are upon all His works.","All Your works will praise You, O Jehovah; / And Your faithful ones will bless You.","They will speak of the glory of Your kingdom / And tell of Your power,","To make known to the sons of men Your mighty acts / And the glorious splendor of Your kingdom.","Your kingdom is an eternal kingdom, / And Your dominion is throughout all generations.","Jehovah upholds all who are falling / And raises up all who are bowed down.","The eyes of everyone wait for You, / And You give them their food in due season.","You open up Your hand / And satisfy the desire of every living thing.","Jehovah is righteous in all His ways, / And faithfully kind in all His doings.","Jehovah is near to all who call upon Him, / To all who call upon Him in truth.","He will fulfill the desire of those who fear Him, / And He will hear their cry and save them.","Jehovah preserves all who love Him, / But He will destroy all the wicked.","My mouth will speak the praise of Jehovah, / And all flesh will bless His holy name forever and ever."],["Hallelujah! / Praise Jehovah, O my soul!","I will praise Jehovah while I live; / I will sing psalms to my God while I yet have being.","Do not trust in princes, / In a son of man, with whom there is no salvation.","His breath goes forth; he returns to his earth; / On that day his plans perish.","Blessed is the man whose help is the God of Jacob, / Whose hope is in Jehovah his God,","Who made heaven and earth / And the sea, and all that is in them; / Who keeps faith forever;","Who executes judgment for the oppressed; / Who gives food to the famished. / Jehovah frees the prisoners;","Jehovah opens the eyes of the blind; / Jehovah raises up those who are bowed down; / Jehovah loves the righteous;","Jehovah preserves the sojourners; / He upholds the orphan and the widow; / But He subverts the way of the wicked.","Jehovah will reign forever, / Your God, O Zion, forever and ever. / Hallelujah!"],["Hallelujah! / For it is good to sing psalms to our God; / For it is pleasant; praise is fitting.","Jehovah builds up Jerusalem; / He gathers the outcasts of Israel.","He heals the brokenhearted / And binds up their wounds.","He counts the number of the stars; / He calls them all by their names.","Great is our Lord, and mighty in power; / His understanding is infinite.","Jehovah uplifts the lowly; / He brings the wicked down to the ground.","Sing unto Jehovah with thanksgiving; / Sing psalms to our God with the lyre;","Who covers the heavens with clouds, / Who prepares rain for the earth, / Who causes grass to grow on the mountains,","Who gives to the beast its food, / And to the young ravens who cry.","He takes no delight in the strength of horses; / Nor pleasure in the legs of man.","Jehovah takes pleasure in those who fear Him, / In those who hope in His lovingkindness.","Laud Jehovah, O Jerusalem; / Praise your God, O Zion;","For He has strengthened the bars of your gates; / He has blessed your children within you.","He makes peace in your borders; / He satisfies you with the finest wheat.","He sends forth His command to the earth; / His word runs very swiftly.","He gives snow like wool; / He scatters frost like ashes;","He casts His hail like crumbs — / Who can stand before His cold?","He sends forth His word and melts them; / He causes His wind to blow; the waters flow.","He declares His word to Jacob, / His statutes and His ordinances to Israel.","He has not dealt so with any other nation; / And as for His ordinances, they have not known them. / Hallelujah!"],["Hallelujah! / Praise Jehovah from the heavens; / Praise Him in the heights.","Praise Him, all His angels; / Praise Him, all His hosts.","Praise Him, sun and moon; / Praise Him, all stars of light.","Praise Him, you heaven of heavens, / And you waters that are above the heavens.","Let them praise the name of Jehovah; / For He commanded, and they were created.","And He established them forever and ever; / He gave the decree which shall not pass away.","Praise Jehovah from the earth, / You sea monsters and all the depths;","Fire and hail, snow and smoke; / Stormy wind that executes His word;","Mountains and all hills; / Fruit trees and all cedars;","All animals wild and tame; / Creeping things and birds of flight;","Kings of the earth and all peoples; / Princes and all judges of the earth;","Choice young men as well as virgins; / Old men with young men.","Let them praise the name of Jehovah, / For His name alone is exalted; / His glory is above the earth and the heavens.","And He has raised up a horn for His people, / The praise of all His faithful ones, / The children of Israel, a people near to Him. / Hallelujah!"],["Hallelujah! / Sing a new song to Jehovah; / Sing His praise in the congregation of His faithful ones.","Let Israel rejoice in his Maker; / Let the children of Zion exult in their King.","Let them praise His name with dancing; / Let them sing psalms to Him with the tambourine and the lyre.","For Jehovah takes pleasure in His people; / He adorns the lowly with salvation.","Let the faithful ones exult in glory; / Let them give a ringing shout upon their beds.","Let the high praises of God be in their throats, / And a two-edged sword in their hand,","To execute vengeance on the nations / And punishment among the peoples;","To bind their kings with fetters / And their nobles with chains of iron;","To execute upon them the judgment written. / This honor is for all His faithful ones. / Hallelujah!"],["Hallelujah! / Praise God in His sanctuary; / Praise Him in the expanse that manifests His power.","Praise Him for His mighty acts; / Praise Him according to His vast greatness.","Praise Him with the blast of the trumpet; / Praise Him with the harp and lyre;","Praise Him with the tambourine and with dancing; / Praise Him with the stringed instrument and the pipe.","Praise Him with the loud cymbals; / Praise Him with the loud clanging cymbals.","Let everything that has breath praise Jehovah. / Hallelujah!"]]